[
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "61",
        "Course Name": "Intro to Machine Learning and NLP",
        "Club": "Web and Coding Club ",
        "Desc_short": "Learn how machines understand and generate human language. This hands-on learnerspace covers everything from NLP fundamentals to advanced deep learning models like BERT and GPT, using tools like Hugging Face and GANs. Perfect for developers, data scientists, and AI enthusiasts looking to build real-world NLP applications.",
        "Desc": "This comprehensive course blends the power of Machine Learning (ML) with the language understanding capabilities of Natural Language Processing (NLP). Designed for aspiring AI engineers, data scientists, and developers, the course begins with the core principles of ML and gradually transitions into the specialized world of NLP.\n\nYou'll begin by learning python libraries and the core building blocks of NLP: tokenization, stemming, lemmatization, part-of-speech tagging, and named entity recognition. \n\nAs the course progresses, you'll dive into deep learning for NLP, understanding recurrent neural networks (RNNs), LSTMs. From there, we transition into the world of Transformers covering key models like BERT. \n\nUsing the Hugging Face ecosystem, you'll gain hands-on experience in fine-tuning pre-trained models for downstream tasks such as sentiment analysis, text classification, question answering, and summarization. The course also introduces Generative Adversarial Networks (GANs) applied to text generation—a challenging and emerging area in NLP.\n\nThroughout the course, you'll work on real-world projects that reinforce learning and prepare you for building production-ready NLP applications.",
        "Week_time": "18-20 hours",
        "Evaluation": "You will be solving weekly exercises and a capstone project at the end of 4th week.",
        "Certification": "Minimum set level of accuracy in assignments and the Capstone project",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Sarthak (9739348680) , Avnish (9167339950) , Mrigank (8802026300) , Utkarsh (8826799261)",
        "Week 1": "Foundations of NLP & Data Processing\n\n-> Introduction to NLP\nNLP pipeline overview: tokenization, preprocessing, vectorization, modeling, evaluation.\n\n-> Python Libraries\nNumPy: Numerical operations (arrays, broadcasting, vectorized math).\nPandas: Data handling (Series, DataFrames, handling text columns).\nText preprocessing using sklearn.\n\n-> Regex (Regular Expressions)\nBasics: pattern matching, wildcards, quantifiers.\nPractice with Python’s re module.",
        "Week 2": "Classical NLP Modeling\n\n-> Text Vectorization\nTF-IDF (Term Frequency-Inverse Document Frequency):\nConcept of bag-of-words vs TF-IDF.\n\n-> Logistic Regression for Text Classification\nTraining and evaluating a classifier for sentiment analysis or spam detection.\nMetrics: Accuracy, Precision, Recall, F1-score.\nHands-on: train a TF-IDF + Logistic Regression model.\n\n-> Word & Sentence Embeddings\nLimitations of one-hot and TF-IDF.\nWord2Vec, GloVe, and FastText.\nSentence embeddings (e.g., Sentence-BERT).\n",
        "Week 3": "Deep Learning & Modern NLP\n\n-> Transformers\nThe transformer architecture (attention mechanism, encoder-decoder blocks).\nKey models: BERT, GPT, RoBERTa, etc.\nPretraining vs fine-tuning.\n\n-> Hugging Face Library\nUsing the transformers library.\nTokenization, loading pretrained models, pipelines (e.g., pipeline('sentiment-analysis')).\nFine-tuning on custom data using Trainer API.\n\n-> Overview of Generative Adversarial Networks\n\n-> Bonus: Diffusion in NLP\nOverview of Diffusion Models.\nHow these are adapted for text generation.\n",
        "Week 4": "Final Project\n\n-> Final NLP Project\n\n-> Wrap-Up & Beyond\nRecap of all topics.\nWhere to go next? (e.g., LLMs, fine-tuning techniques, Reinforcement Learning for NLP)",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "62",
        "Course Name": "Full Stack Pro: Frontend to Backend",
        "Club": "Web and Coding Club",
        "Desc_short": "Dive into the world of full stack development with this hands-on learners' space course that teaches you how to build complete, production-ready web applications. You'll create stunning, responsive frontends using React, power your backend with Django and REST APIs, and integrate robust data storage with MongoDB or PostgreSQL. From dynamic UIs to secure user authentication and real-time data handling, this course equips you with everything you need to become a full stack developer.\nPerfect for beginners to go full stack.",
        "Desc": "The web powers everything around us—from simple blogs to large-scale social networks and enterprise apps. This immersive, hands-on course is your complete guide to becoming a professional full stack web developer. Whether you're starting from scratch or looking to sharpen your skills, this course will take you through the entire web development journey, step by step.\n\nYou'll begin by learning the core building blocks of the web: HTML, CSS, and JavaScript. These technologies form the foundation of every website and web app. You’ll master how to structure content, style layouts, and add interactivity from the ground up, giving you a solid start before diving into complex tools and frameworks.\n\nFrom there, you'll move into building modern, interactive frontends using React, the most popular frontend library today. You'll learn to develop dynamic user interfaces, manage application state, and connect with APIs to bring your apps to life. You’ll also explore tools like React Router, Tailwind CSS, and best practices for component-based development.\n\nOn the backend, you'll learn to build powerful web services using Django, a high-level Python web framework known for its speed and scalability. With Django and Django REST Framework (DRF), you'll learn how to create RESTful APIs, manage server-side logic, and handle authentication, security, and database operations.\n\nThis course also includes deep dives into databases. You'll understand how to model data effectively, and how to integrate them with your full stack applications.",
        "Week_time": "18-20 hours",
        "Evaluation": "You will be solving small weekly tasks and creating basic webpages. At the end you will be creating a full stack website.",
        "Certification": "Minimum set amount of tasks completed and final full stack website.",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Mithra (8762070856) , Shivansh (7869735629)",
        "Week 1": "Web Fundamentals + Intro to React\nGoal: Build a strong foundation in frontend development and get started with React.\n\nTopics:\nHTML: Structure, elements, forms, semantic tags\n\nCSS: Styling, Flexbox, Grid, responsive design basics\n\nJavaScript: Variables, functions, DOM manipulation, events\n\nGit & GitHub: Basics of version control\n\nIntro to React",
        "Week 2": "Deep Dive into React + Django Setup\nGoal: Strengthen React skills and set up the backend using Django.\n\nReact Router for navigation\n\nEvent handling & conditional rendering\n\nForm handling and controlled components\n\nFetching data with fetch / Axios\n\nDjango Topics:\nInstalling Python & Django\n\nCreating Django project & apps\n\nDjango views, URLs, templates\n\nStatic files & basic templates\n\nSetting up Django REST Framework (DRF)",
        "Week 3": "Backend APIs with Django REST Framework\nGoal: Build a full-featured backend with REST APIs.\n\nTopics:\nDjango Models and ORM\n\nSerializers and ViewSets\n\nCRUD operations with Django REST Framework\n\nToken-based authentication (JWT or Django auth)\n\nConnecting React to Django APIs\n\nHandling CORS & environment setup",
        "Week 4": "Databases + Final Full Stack Project\nGoal: Connect everything together with a database and build a deployable full stack project.\n\nTopics:\nPostgreSQL or MongoDB basics (choose based on project)\n\nIntegrating databases with Django\n\nData migrations & relationships\n\nFinalizing API integration with frontend\n\nProject structuring & cleanup\n\nFinal Full stack Project",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "63",
        "Course Name": "WebCraft : Open Source Fun ToolKit",
        "Club": "ITC Web Team",
        "Desc_short": "Start your coding journey: learn HTML, CSS & JavaScript, build a simple game or utility, then deploy it live on the ITC website",
        "Desc": "\n\nThis course will introduce you to web development and open source contribution  both of which are crucial for any tech profile and in forums like GSoC ( Google Summer of Code)\n\n- Component Magic\nBreak UIs into bite-sized HTML/CSS/JS pieces\nHands-on: craft your own Application or mini game like unit converter or currency converter\n\n- Publish to the Web\nPush code to our repo & watch it go live\nLearn the simple steps to make your project viewable by all\n\n- Your Unique Mini-Project\nPick from fun apps (Currency Converter, Quiz, Tip Calculator…)\nBuild, refine & plug your component into the ITC site\n\n- Launch Day & Feedback\nLive demo of everyone’s mini-apps and will be publicized on the web team website \nCelebrate your work & let your tech journey begin with an interesting project on your portfolio !!",
        "Week_time": "12 - 15 hours",
        "Evaluation": "Weekly update / assignment submissions\nFinal mini-project demo & code quality ",
        "Certification": "Complete your final project by end of Week 4",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Riya Agrawal (7669697471)",
        "Week 1": "HTML structure & semantic tags\nCSS basics: layout with Flexbox\nBuild a Card Component (title, image placeholder, description)\nStyle it responsively for mobile + desktop",
        "Week 2": "JS variables, functions & events\nDOM selection & manipulation\nCreate a Unit Converter Widget (e.g. cm ↔ in)\nInputs + buttons to select conversion type",
        "Week 3": "Handling forms & real-time calculations in JS\nBest practices for reusable components\nPick one mini-app and build core functionality + basic styling",
        "Week 4": "Submit your mini-app component PR\nReview code quality & styling tips\nHow our automated deploy makes your app live (you just push!)",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "64",
        "Course Name": "Hardware security",
        "Club": "EESA",
        "Desc_short": "Cache Me If You Can - Unveiling Cache based Microarchitectural Side-Channel Attacks",
        "Desc": "Behind every fast computer is a tiny secret: CPU caches and they can spill more than just performance! In this project, we’ll tap into the stealthy world of microarchitectural side-channel attacks, where students become digital detectives, uncovering how attackers eavesdrop on cache behavior to steal secrets.\n\nThrough hands-on implementation of attacks like Flush+Reload and Occupancy-based attacks, they’ll uncover how cache timing and contention can silently betray even the most secure systems. Welcome to the world where your cache talks behind your back, Let’s try to listen.",
        "Week_time": "10-12 hours",
        "Evaluation": "Bandwidth and accuracy in both parts of project \n\nFor Both parts of Project:- \nTotal Score (out of 50) = (Accuracy / 100)*25 + (Bandwidth / Highest Bandwidth achieved)*25\n\nNote:- Accuracy is in percentage and Bandwidth is in bits per second",
        "Certification": "Total score greater than 70",
        "Pre-req": "Either Linux or WSL(not preferred) installed",
        "Contact info": "Praveen Prajapat (9785299880)",
        "Week 1": "OS Memory Management (Virtual to Physical address translation, Concept of OS Pages), Cache Hierarchy, Cache Coherence, Replacement policies, Data flow during a Program run, Measuring Cache and Memory latencies, Special instructions - CLFLUSH, RDTSC, LSCPU and few others",
        "Week 2": " Flush and Reload attack Implementation (Project - Part 1)",
        "Week 3": "Cache Occupancy based attack Implementation (Project - Part 2)",
        "Week 4": "Mitigations of above two attacks - Randomized caches, Way partitioning, Set partitioning, Page coloring, Other microarchitectural attacks -  Spectre and Meltdow",
        "Week Null": "Shouldn't be needed"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "65",
        "Course Name": "Introduction to Cryptography",
        "Club": "Cyber Security Community",
        "Desc_short": "Join CSeC's \"Introduction to Cryptography\" course and dive into the fascinating world of codes, ciphers, and cybersecurity! Learn how encryption protects data, explore classic & modern cryptographic techniques, and discover the math behind secure communication. Perfect for beginners—no prior experience needed!",
        "Desc": "Introduction to Cryptography – Course Breakdown\n1. Classical Ciphers\n\nExplore the roots of cryptography with historical encryption methods like the Caesar cipher, Vigenère cipher, and substitution techniques. Learn how these early systems worked, why they were eventually broken, and their influence on modern security.\n\n2. Modern Cryptography (The Math Behind It)\n\nDive into the core mathematical concepts powering today’s encryption—XOR operations, modular arithmetic, and public-key cryptography (RSA). Understand the difference between symmetric and asymmetric encryption and how they protect data.\n3. Advanced Topics (AES, Diffie-Hellman & More)\n\nTake a deep dive into industry-standard algorithms like AES and key exchange protocols like Diffie-Hellman (DHKE). Learn about hashing, digital signatures, and real-world cryptographic applications.\n4. Project – Putting It All Together\n\nCombine everything you’ve learned into a project that makes (or perhaps even breaks) a complex encryption scheme using the tools of cryptography.",
        "Week_time": "2-3 hours",
        "Evaluation": "30%: Solutions to challenges in each section\n70%: Project Submission",
        "Certification": "Based on the project",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Niral Charan (6369057961)",
        "Week 1": "Classical Ciphers such as Caesar Cipher, Vigenère cipher, etc and how to break them.",
        "Week 2": "\nModern Cryptography: The math behind it, public  key cryptography and RSA\n",
        "Week 3": "Advanced Topics: AES, Diffie-Hellman & More",
        "Week 4": "Project and some advanced topics if enough interest",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "66",
        "Course Name": "Tools For Cyber Security",
        "Club": "Cyber Security Community",
        "Desc_short": "\"Level up your cyber skills with the hacker's ultimate toolkit!\n\nIn this hands-on course, you'll master the Linux command line, Python Scripting, Coding in C , and peek inside binaries with Assembly. \n\nPerfect for those who want to get into cyber security, or anyone who wants to understand how cyber tools really work under the hood. No prior experience required - just bring your curiosity!",
        "Desc": "This course is intended to familiarize you with the major tools are needed to learn cyber security. It'll be an amazing starting point for diving deeper into the topics you enjoy\n\nWe will cover the Linux command line, bash scripting, python scripting, basic C programming and x86 assembly.\n\nYou'll reinforce your learning through solving engaging challenges\nand then put it all together in a project to really put your skills to the test!\n",
        "Week_time": "2-3 hours",
        "Evaluation": "30% Challenges: There will be short challenges for you to solve in each section\n70%  Final Project: A somewhat longer form project to really help you apply what you have learned",
        "Certification": "Final Project",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Niral Charan (6369057961)",
        "Week 1": "The Linux Command line and Bash Scripting",
        "Week 2": "Python Scripting, alongside Cyber Security related libraries",
        "Week 3": "Basic C programming and x86 Assembly",
        "Week 4": "A long form project allowing for a detailed application of the topics covered",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "67",
        "Course Name": "Handwritten Digit Recognition using Convoluted Neural Networks",
        "Club": "AI Community",
        "Desc_short": "Ever wondered how machines learn to read? Dive into the world of Artificial Intelligence and master the art of teaching computers to recognize handwritten digits ! \n\nThis hands-on course unlocks the power of Convolutional Neural Networks (CNNs), guiding you from pixels to predictions. \n\nGet ready to code, create, and conquer one of AI's foundational challenges !",
        "Desc": "Join us as we delve deep into the architecture and application of Convolutional Neural Networks (CNNs), the workhorse behind many of today's image recognition breakthroughs. You'll start with the fundamentals of neural networks and progressively build your expertise to design, train, and deploy sophisticated CNN models capable of accurately identifying handwritten characters.\n\nWhat You Will Learn:\n\nFundamentals of Machine Learning & Neural Networks: Grasp the core concepts that underpin AI and deep learning.\n\nImage Data Preprocessing: Learn essential techniques to prepare and augment image datasets (like the famous MNIST dataset) for optimal model performance.\n\nThe Power of Convolutional Neural Networks (CNNs): Understand the architecture of CNNs, including convolutional layers, pooling layers, and fully connected layers, and why they excel at image-based tasks.\n\nBuilding & Training CNN Models: Gain hands-on experience in constructing CNNs using popular deep learning frameworks (e.g., TensorFlow/Keras or PyTorch).\n\nReal-World Applications: Explore how the principles learned in handwritten digit recognition extend to other computer vision tasks like object detection and image classification.",
        "Week_time": "7 hours",
        "Evaluation": "Weekly Assignments alongwith MCQ's to be completed and a final Project-Based Evaluation.",
        "Certification": "Project-Based",
        "Pre-req": "None",
        "Contact info": "Manish Shaw (6291445696), Devansh Yadav (8178443601)",
        "Week 1": "Fundamentals of Machine Learning & Neural Networks.",
        "Week 2": "Learn essential techniques to prepare and augment image datasets (like the famous MNIST dataset) for optimal model performance.",
        "Week 3": "Understand the architecture of CNNs, including convolutional layers, pooling layers, and fully connected layers, and why they excel at image-based tasks.",
        "Week 4": "Gain hands-on experience in constructing CNNs using popular deep learning framework - PyTorch.",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "31",
        "Course Name": "Carbon Capture",
        "Club": "Energy and Sustainability Club",
        "Desc_short": "Carbon Capture & Storage is a game changing solution to decarbonize heavy industries and power systems. In this 4 week's course discover how engineers, scientists, and startups are reshaping the carbon equation by capturing carbon from industrial sources and then safely storing it underground.",
        "Desc": "This course will be conducted in the span of 4 weeks. In the 1st week, we will introduce what is carbon capture and in how many ways CO2 is produced and how it is adversely affecting our environment. In the 2nd week, we will introduce different types of carbon capture technologies and also the materials used. In the 3rd week, we will introduce different ways to store and utilize captured CO2. In the 4th week, we will cover the policies, economics related to carbon capture and storage also what the future holds for this.",
        "Week_time": "4-5 hours",
        "Evaluation": "1) Weekly quizzes - 40% 2) Bi-Weekly case studies - 40% 3) Final quiz and Essay type on what you learnt - 20% ",
        "Certification": "For certificate at-least 60% course should be completed.",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Tejas Jadhav (8767417734)",
        "Week 1": "Introduction to carbon capture and storage and why it is important like how carbon is affecting climate and health of peoples. ",
        "Week 2": "Introduction to technology used for carbon capture including post combustion, pre combustion and oxy-fuel combustion and Direct air capture and bioenergy with CCS also materials used. ",
        "Week 3": "How we can store carbon capture like geological storage, carbon mineralization and enhanced oil recovery and co2 utilization in concrete curing and synthetic fuels.",
        "Week 4": "Overall policies related to carbon capture and how much it will cost us for this and what the future holds for this like future technologies.",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "32",
        "Course Name": "Tinker Tetris",
        "Club": "Tinkerers' Laboratory",
        "Desc_short": "Build your own mini game console—retro style with a modern twist!\nIn this hands-on course, you'll craft a portable LED-based arcade machine from scratch using an ESP32, design your own case with 3D printing, and code classics like Snake and Tetris. Wireless controllers, pixelated fun, and endless game customizations await. It's engineering, design, and gaming—all in one epic project.",
        "Desc": "Step into the world of DIY game consoles with this immersive, project-based course where hardware meets creativity.\n\nYou’ll build a fully functional ESP32-powered mini arcade console with a vibrant 8×8 WS2812B RGB LED matrix display. But this isn’t just a circuit—it’s a complete product you’ll design and build from the ground up.\n\nHere’s what you’ll do:\n\nDesign and 3D print a retro-style handheld console case using CAD tools\n\nWire up an ESP32 microcontroller to control LED graphics and game logic\n\nProgram games like Snake, Chase, and Tetris using Arduino or MicroPython\n\nBuild detachable wireless controllers for multiplayer or modular play (just like a mini Nintendo Switch!)\n\nLearn about Bluetooth or ESP-NOW protocols for wireless communication\n\nCustomize gameplay, animations, and control schemes to make it truly your own\n\nWhether you're a student, hobbyist, or aspiring game dev, this course combines coding, electronics, 3D modeling, and game design into one powerful learning experience. You'll not only learn how things work—you’ll build something you can actually play.\n\nBy the end, you’ll walk away with your own custom console, a deeper understanding of embedded systems, and a solid foundation in rapid prototyping and interactive tech.",
        "Week_time": "7 hrs",
        "Evaluation": "Grading Breakdown\n- Assignments (combined): 40%\n  Hands-on tasks given throughout the course to reinforce learning.\n\n- Attendance: 20%\n  Presence in sessions is crucial.\n\n - Final Project: 40%\n   Your fully functioning game console will be the culmination of all skills learned.\n\n\nTo be eligible to work on and submit the final project, students must:\n\n - Maintain at least 80% attendance\n\n - Submit all assignments\n\n - Achieve a minimum of 60% total score combined from assignments.\n\nProject completion will be evaluated based on functionality, creativity, and completeness.",
        "Certification": "To receive the course completion certificate, students must:  1) Successfully complete the final project – A fully functional ESP32-based game console with working controls, LED display, and at least one playable game. 2) Submit complete documentation of learnings and code – A brief report covering the project build process, key learnings, challenges faced, and annotated code.",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Prathamesh Bende (9423149159), Dhruv Chaturvedi (9171981824)",
        "Week 1": "Theme: Getting Started with the ESP32 & WS2812B\nObjectives:\n\n- Understand ESP32 architecture and development environment\n\n- Learn basic programming using Arduino or MicroPython\n\n- Get familiar with the WS2812B RGB LED matrix\n\nTopics Covered:\n\n- Introduction to the course and final project scope\n\n- ESP32: Features, pinouts, setup (Arduino IDE / Thonny for MicroPython)\n\n- Digital I/O, PWM, serial communication basics\n\n- RGB color theory and WS2812B protocols\n\n- Using Adafruit NeoPixel / FastLED libraries\n\n- Controlling a single LED and lighting patterns\n\n- Rendering basic shapes/pixels on 8×8 matrix\n\n- Matrix mapping and addressing pixels",
        "Week 2": "Theme: Game Logic & Pixel-Based Rendering\nObjectives:\n\n- Build understanding of game loops, logic, and rendering with limited resources\n\n- Design and simulate basic games like Snake or Chase\n\nTopics Covered:\n\n- Game loop architecture (setup, update, render)\n\n- Input handling (initially via serial / hardcoded logic)\n\n- Graphics on 8×8: pixel mapping, movement, collision detection\n\n- Frame buffering and optimization for LED matrix\n\n- Snake Game: Design, logic flow, implementation",
        "Week 3": "Theme: Controller Design and Communication Protocols\nObjectives:\n\n- Teach wireless communication between ESP32 modules\n\n- Lay groundwork for modular console design with detachable controllers\n\nTopics Covered:\n\n- Bluetooth Low Energy (BLE) vs ESP-NOW overview\n\n- Setting up ESP-NOW for low-latency communication\n\n- Making one ESP32 act as game controller (input device)\n\n- Sending directional/button inputs to main ESP32\n\n- Protocol design: packets, encoding inputs\n\n- Designing a modular system: magnetic/detachable ideas, battery power, casing considerations",
        "Week 4": "Theme: Project Implementation & Showcase\nObjectives:\n\n- Assemble the game console\n\n- Implement at least one full game with controllers\n\n- Showcase modular and portable features\n\nActivities:\n\n- Distribution of kits to eligible participants\n\n- Build station setup (soldering, wiring, casing)\n\nStep-by-step assembly:\n\n- ESP32 core + Matrix display\n\n- Controller units + ESP-NOW link\n\n- Power supply integration (Li-ion + charging circuit)\n\n- Final game installation & testing\n\n\nFinal Project Deliverables:\n\n- Working portable console\n\n- At least 1 game implemented with wireless controller support",
        "Week Null": "The Project submission deadline might be extended due to the students coming to campus late, so the resume verification criteria in that case would be the same as the final project eligibility criteria"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "33",
        "Course Name": "Aerial Robotics Course",
        "Club": "Aeromodelling Club",
        "Desc_short": "Take flight with Aerial Robotics – learn MATLAB fundamentals, build and control quadcopters, fine-tune with PID, and chart intelligent paths using A*",
        "Desc": "The Aeromodelling Club is back again with its flagship Aerial Robotics course! From mastering MATLAB basics and exploring quadcopter dynamics to implementing precise PID control and diving into autonomous path planning : we covered it all. And this year, we took things up a notch by integrating the powerful A* algorithm, enabling smarter, faster, and more efficient autonomous navigation.\n\nWhy just fly, when you can think and fly?",
        "Week_time": "5-6 hours",
        "Evaluation": "The course assessment is designed to encourage consistent learning and hands-on application, with a combination of weekly assignments and a final hardware project. \n\nNote:\n\nCompletion of all weekly assignments with satisfactory performance is mandatory to qualify for the final hardware project.\n\nRegular participation in interactive doubt sessions is encouraged to clarify concepts and enhance learning outcomes.\n\n",
        "Certification": "To successfully complete the Aerial Robotics course and receive certification, participants must:  1. Complete all weekly assignments Submit each week's assignment by the deadline.  2. Achieve above-threshold scores Score above the minimum required marks in all weekly assessments to demonstrate consistent understanding.  Only participants who fulfill both criteria will be eligible for the final project and certification.",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Arya Patil (8879354729), Siddhesh Mane (8793419105), Anamika Garg (7999781698)",
        "Week 1": "Kickstart with the basics of MATLAB, understand drone sizing, and dive into quadrotor kinematics through thrust sizing techniques.\n",
        "Week 2": "Explore the physics of flight with quadrotor dynamics and implement your first 1D PID controller for stability and precision.\n",
        "Week 3": "Week 3: Move to the next dimension : grasp 2D control fundamentals and implement a working 2D quadcopter controller.\n",
        "Week 4": "Week 4: Take on the skies with 3D quadrotor control, delve into autonomous navigation, and bring it all together in hands-on implementation.\n\n",
        "Week Null": "Week 5: Wrap up with intelligence! Learn the basics of path planning through the A* algorithm for smarter autonomous flight.\n\n\n"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "34",
        "Course Name": "Circuits That Solve",
        "Club": "EESA",
        "Desc_short": "Learn how circuits can do math! This course blends core analog electronics \nwith dynamic system modeling, guiding you from circuit basics to building and simulating an analog solver for the famous Predator-Prey equations—all using op-amps, and LTSpice",
        "Desc": "Worried that analog circuits are too complicated? This course is made for you! We start from the basics—learning simple rules like Kirchhoff’s laws and how to analyze circuits step-by-step. You’ll get introduced to diodes and op-amps, the building blocks of analog electronics, and see how these tiny components can actually solve real problems. \n\nTogether, we’ll simulate and build circuits that mimic math in action — including a cool project where you’ll create an analog circuit that models a predator-prey system (think foxes and rabbits interacting). Using easy-to-learn tools like LTSpice, you’ll watch equations come to life as circuits. \n\nDon't know LT Spice? Worry not, we have got your back. You will get full exposure to how you \ncan simulate basic to complex circuits. \n\nNo heavy math or confusing theory upfront—just simple ideas, fun experiments. By the end, \nyou’ll understand how analog electronics can do much more than you thought, and you’ll have designed a circuit that actually solves problems.",
        "Week_time": " 5-7 hours",
        "Evaluation": "Assignment Plan –  \nWeek 1: Basic Circuit Solving and Simulation (10%) - Simulate basic circuits in LTSpice. \n\nWeek 2: Op-Amp-Based Circuit (10%) - Design and simulate a basic op-amp configuration (e.g., inverter or summing amplifier). - Focus on understanding op-amp behavior and signal processing. \n\nWeek 3: Analog Multiplier (30%) - Build and simulate an analog multiplier using op-amps and diodes. - Learn how circuits can implement non-linear operations. \n\nWeek 4: Final Project – Analog Differential Equation Solver (50%) - Design and simulate a complete analog circuit that solves the predator-prey model. - Combine concepts from all weeks to build and explain a real analog computing application.",
        "Certification": "Project Completion & minimum 70/100 marks ",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Apoorv Goyal (8107166993), Stavan Mehta (6353885069), Shreya Nigam (8904495520)",
        "Week 1": "Getting Started with Circuits - Topics Covered: - Introduction to analog circuits and what they can do - Kirchhoff’s Current Law (KCL) and Voltage Law (KVL), basic resistor networks - Thevenin and Norton equivalents (intuitively, with examples) - LTSpice Basics – how to draw, simulate, and read circuit outputs - Goal: Build comfort with analyzing and simulating simple resistor-based circuits.",
        "Week 2": "Diodes and Op-Amps – Your Circuit Superpowers - Topics Covered: - Understanding Diodes – characteristics, clipping/clamping circuits - Introduction to Op-Amps: - Inverting, non-inverting, buffer configurations - Op-Amp assumptions (ideal behavior).",
        "Week 3": "Applications: adder, subtractor, comparator etc. - Analog Math with Op-Amps: - Op-Amps as summing amplifiers and differential amplifiers - How circuits can \"do math\" - Goal: Learn how op-amps and diodes help us perform basic analog computation. This can also include a Transistor 101 segment if really needed and the students seem to like it.",
        "Week 4": "Circuits That Solve – The Final Project Phase - Topics Covered: - Op-Amp Integrators – key building block of analog computers - Connecting math to circuits: solving differential equations using integration and summation - Understanding the Predator-Prey Model: - What it models (basic explanation of the two coupled differential equations) - How population dynamics can be simulated with op-amps - Step-by-step guide to building the circuit: - Mapping the equations - Choosing op-amp blocks - Goal: Use everything learned to build and simulate an analog computer that solves the predator-prey differential equations. ",
        "Week Null": "Should not be needed, but if in case needs to slow down the pace, we can think of assignment evaluations for the first few weeks as a criteria for the resume verifcation."
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "35",
        "Course Name": "Physics of Semiconductor Devices",
        "Club": "EESA",
        "Desc_short": "Curious how we turned a rock into a thinking machine? This course dives into the fundamental physics behind semiconductor devices—the building blocks of all electronics. Using basic principles of electromagnetism and quantum mechanics, we’ll explore how transistors work, culminating in a hands-on simulation project.",
        "Desc": "This course is an introduction to the fascinating world of semiconductor device physics—the science that powers modern electronics. Starting from a JEE level understanding of physics and math, the course walks you through the fundamental principles that explain how electronic devices like transistors actually work.\n\nWe’ll begin with the basics: energy bands in solids, carrier types (electrons and holes), and how electric fields affect charge transport in materials. As we progress, we’ll build up tools like carrier statistics, drift and diffusion models, and energy band diagrams to understand how current flows through a semiconductor. These concepts will come together as we develop a physics-based model for one of the most important devices in electronics: the MOSFET.\n\nThe course will be spread over four weeks and will consist of interactive online sessions, weekly assignments to reinforce key ideas, and a final project where you’ll simulate the basic device physics of a MOSFET using the concepts you’ve learned. No prior knowledge of electronics is expected—just curiosity and a willingness to learn!",
        "Week_time": " 4-6 hours",
        "Evaluation": "20% Assignments * 3=60%\n(make a video explaining your understanding of the week in 5 mins)\n\nProject- 40%",
        "Certification": "A total of 50% out of 100%",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Aryamman Bhatia (7977994553)",
        "Week 1": "Semiconductor Fundamentals\n- Energy bands: conduction, valence, and bandgap\n- Electrons and holes; effective mass and mobility\n- Intrinsic and extrinsic semiconductors\n- Doping and Fermi level\n- Density of states\n- Carrier concentration and temperature dependence",
        "Week 2": "Carrier Transport and Band Diagrams\n- Drift and diffusion current\n- Einstein relation and mobility\n- Built-in electric fields and potential\n- Energy band diagrams: equilibrium and under bias\n- Quasi-Fermi levels (conceptual)",
        "Week 3": "The PN Junction Diode\n- PN junction formation and depletion region\n- Built-in potential and space charge\n- Forward and reverse bias behavior\n- Ideal diode equation and I–V characteristics\n- Reverse breakdown (brief)",
        "Week 4": "The MOSFET and Project\n- MOS structure and MOS capacitor basics\n- Threshold voltage and channel formation\n- Modes of operation: cutoff, linear, saturation\n- Basic MOSFET I–V characteristics\n- Final project: make a simulation model of a MOSFET using fundamental physics",
        "Week Null": "Won't be needed"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "36",
        "Course Name": "Control Theory Bootcamp",
        "Club": "Electronics & Robotics Club",
        "Desc_short": "This course is your gateway into the world of control systems — the brains behind every smart, stable machine. We’ll break down the core math, then take a deep dive into MATLAB Simulink, the gold standard for simulating and designing real-world systems.\n\nYou’ll start by crafting a rock-solid PID controller, then level up with the smooth precision of an LQR controller. To tie it all together, you’ll build your own self-balancing bot — because what’s the point of theory if you can’t show it off?",
        "Desc": "This course offers a structured journey through the fundamentals of control systems, culminating in the design and implementation of a self-balancing robot. It begins with a deep dive into core control theory, covering system modeling, stability, and feedback — essential tools for understanding how dynamic systems behave and can be controlled.\n\nBuilding on this foundation, students will explore MATLAB Simulink, the industry-standard platform for control system simulation and design. Through hands-on projects, participants will implement both PID and Linear Quadratic Regulator (LQR) controllers, learning how to tune and analyze their performance in simulated environments.\n\nThe course then transitions from simulation to physical systems, where students will model and stabilize a self-balancing bot using the controllers they've designed. In the final phase, the focus shifts to achieving smooth maneuvering and responsive control, integrating all prior knowledge into a fully functional robotic system. By the end, students will have both a strong theoretical grounding and tangible experience in modern control system implementation.",
        "Week_time": "4-5 hours",
        "Evaluation": "The course shall consist of 2 assignments and 1 project. \nAttendance : 5% * 4 sessions\nAssignment 1: 15% \nAssignment 2: 25%\nProject Phase 1: 25%\nProject Phase 2: 30%\n\nWeightages are subject to minor changes, if required during the camp. The project will be provided well in advance.",
        "Certification": "80% or above performance in the course.",
        "Pre-req": "Elementary proficiency in Class XI & XII Physics and Mathematics",
        "Contact info": "Kunal Gandvane (9510190597), Radhika Agarwal (7007582491), Daksh Makwana (9660852364), Dhruv Singla (8059593359)",
        "Week 1": "This week lays the theoretical groundwork for control systems. You'll learn how to model dynamic systems using differential equations and transfer functions, analyze system stability, and understand the role of feedback in control. Core concepts such as open-loop vs. closed-loop systems, time and frequency domain analysis, and performance metrics like rise time, settling time, and overshoot will be covered. This week ensures you have a strong analytical base before moving into simulation and design.",
        "Week 2": "This week marks the transition to practical implementation using MATLAB Simulink. You'll learn to simulate control systems and implement classical PID controllers, understanding how to tune them using methods like Ziegler-Nichols and trial-and-error in a visual modeling environment. The week also introduces the Linear Quadratic Regulator (LQR) — a state-space-based optimal controller — giving you a deeper perspective on modern control techniques. You'll compare PID and LQR in terms of design philosophy, performance, and application.",
        "Week 3": "Here, theory meets application. Using the simulated model of a self-balancing bot (inverted pendulum on wheels), you'll apply the controllers designed in Week 2 to stabilize the system. This involves identifying system dynamics, designing appropriate feedback loops, and fine-tuning controller parameters to keep the bot upright. You'll gain hands-on experience tackling real-world challenges like noise, disturbance rejection, and control signal saturation.",
        "Week 4": "In the final week, you'll extend the functionality of the stabilized bot to include movement and steering. This includes designing control logic for smooth forward, backward, and turning motions while maintaining balance. You'll also work on refining your system’s response to varying setpoints and potentially integrating higher-level command inputs. By the end of the week, you'll have a fully simulated, controllable self-balancing robot built from the ground up.",
        "Week Null": "N/A"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "37",
        "Course Name": "Build Your Own Plant - A Blueprint to Start Manufacturing",
        "Club": "Team ChemEca",
        "Desc_short": "Unlock the secrets of everyday products by designing your own manufacturing plant! This hands-on course takes you from performing a market study for a FMCG product like chocolate or frooti to creating detailed process flow diagrams and even advanced plant designs along with basics of emission analysis. Learn industry tools, master process engineering basics, and earn a valuable certification to boost your career—all while building a real-world project step-by-step.",
        "Desc": "Week-wise Project Details \n\nWeek 1: Market Study on a Product Genre\n1. Learn how to conduct a market analysis for FMCG products, exploring industry trends, consumer demand, and leading brands.\n2. Understand how to evaluate the feasibility of manufacturing different product genres (e.g., chocolates, fruit juices).\n3.  Design a deck summarizing market study findings and rationale for narrowing down to a specific product genre.\n4. Gain experience in synthesizing research and justifying product selection.\nDeliverable:\nAssignment 1 – FMCG Market Study Presentation Deck\n\nWeek 2: Basic Block Diagram of Manufacturing Process\n1. Study the fundamental steps involved in the manufacturing process for the selected FMCG product.\n2. Learn to perform a literature review to identify key process stages.\n3. Practice translating process understanding into a clear, simple block diagram.\n4. Develop concise process descriptions to accompany diagrams.\nDeliverable:\nAssignment 2 – Basic Block Diagram with Brief Process Description\n\nWeek 3: Basic Process Flow Diagram (PFD)\n1. Get introduced to digital diagramming tools like Visual Paradigm.\n2. Learn to convert block diagrams into process flow diagrams, identifying main equipment and process streams.\n3. Understand the basics of process engineering documentation.\n4. (Optional) Begin exploring advanced topics: basics of P&ID and AutoCAD Plant 3D.\nDeliverable:\nAssignment 3 – Basic PFD (compulsory); Optional: Begin P&ID\n\nWeek 4: Refined and Detailed PFD with Emission Assessment \n1. Refine and finalize the digital PFD, incorporating feedback for clarity and accuracy.\n2. Learn to represent all process streams, equipment, and connections in detail.\n3. Conduct an emission assessment for the designed plant, identifying potential emissions and their sources.\n4. (Optional) For advanced learners: Expand the PFD into a basic P&ID, adding instrumentation, control, and safety features, and explain one such feature.\nDeliverable:\nAssignment 4 – Final, Refined Digital PFD (compulsory), Emission Assessment Deck(compulsory), Basic P&ID with Explanation(Optional) ",
        "Week_time": "4-6 hours",
        "Evaluation": "Attendance:\nMandatory participation in 2 out of 2 briefing sessions.\n\nAssignments:\nSubmit at least 2 out of the first 3 weekly assignments.\nSubmission of the final 2 compulsory sub-parts of  Assignment 4 will be required.\n\nNo Weighted Grading:\nAll requirements must be fulfilled for successful completion and certification.\nThere will be an optional capstone P&ID design project\n\nReach out to : Param Aghera- 9428989809  *AND*  Ojas Pathak - 7058448506 in case of any issues.",
        "Certification": "Attendance: Mandatory participation in 2 out of 2 briefing sessions. Assignments: Submit at least 2 out of the first 3 weekly assignments. Submission of the final 2 compulsory sub-parts of  Assignment 4 will be required. No Weighted Grading: All requirements must be fulfilled for successful completion and certification. There will be an optional capstone P&ID design project",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Ojas Pathak (7058448506), Param Aghera (9428989809)",
        "Week 1": "1. Learn how to conduct a market analysis for FMCG products, exploring industry trends, consumer demand, and leading brands.\n2. Understand how to evaluate the feasibility of manufacturing different product genres (e.g., chocolates, fruit juices).\n3.  Design a deck summarizing market study findings and rationale for narrowing down to a specific product genre.\n4. Gain experience in synthesizing research and justifying product selection.\n\nAssignment 1 – FMCG Market Study Presentation Deck",
        "Week 2": "1. Study the fundamental steps involved in the manufacturing process for the selected FMCG product.\n2. Learn to perform a literature review to identify key process stages.\n3. Practice translating process understanding into a clear, simple block diagram.\n4. Develop concise process descriptions to accompany diagrams.\n\nAssignment 2 – Basic Block Diagram with Brief Process Description",
        "Week 3": "1. Get introduced to digital diagramming tools like Visual Paradigm.\n2. Learn to convert block diagrams into process flow diagrams, identifying main equipment and process streams.\n3. Understand the basics of process engineering documentation.\n4. (Optional) Begin exploring advanced topics: basics of P&ID and AutoCAD Plant 3D.\n\nAssignment 3 – Basic PFD (compulsory); Optional: Begin P&ID",
        "Week 4": "1. Refine and finalize the digital PFD, incorporating feedback for clarity and accuracy.\n2. Learn to represent all process streams, equipment, and connections in detail.\n3. Conduct an emission assessment for the designed plant, identifying potential emissions and their sources.\n4. (Optional) For advanced learners: Expand the PFD into a basic P&ID, adding instrumentation, control, and safety features, and explain one such feature.\n\nAssignment 4 – Final, Refined Digital PFD (compulsory), Emission Analysis Deck(compulsory), Basic P&ID with Explanation(Optional) ",
        "Week Null": "Won't be extending the course beyond 4 weeks, it is very trivial and doable. In case it still extends, the assignments submitted until now shall be verified in the resume, Team Leads of Team ChemEca will handle resume verification points."
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Management Summer School (Courses in Consult, Finance, Entrepreneurship, Economics*)",
        "School ID": "2",
        "Course ID": "21",
        "Course Name": "How to Start your Startup",
        "Club": "EnB Club",
        "Desc_short": "Master the art of launching and scaling a startup in just three weeks. Learn from industry experts about idea generation, growth strategies, and building a winning team to achieve entrepreneurial success.",
        "Desc": "This comprehensive three-week course provides aspiring entrepreneurs with essential insights and strategies for starting and scaling a successful startup. Week 1 covers foundational elements such as idea generation, product development, and strategic pivoting, enriched with real-world case studies. Week 2 delves into growth strategies including SEO, email marketing, and user engagement, while emphasizing customer support and press coverage. Week 3 focuses on building a strong company culture, effective team management, and strategic decision-making. Through lectures by industry experts, this course equips participants with the knowledge and skills to navigate the complexities of entrepreneurship.",
        "Week_time": "7-8 hours",
        "Evaluation": "Assignment - 1/week",
        "Certification": "It is suggested to watch all weekly videos and achieve a minimum 50% score on assignments for certification.",
        "Pre-req": "Passionate about entrepreneurship and basic understanding of business concepts. No prior experience required.",
        "Contact info": "Amit Bhartiya (7878469798)",
        "Week 1": "Foundational Elements\n1. Passion and Problem-Solving(Understanding the core of startup success)\n   - Importance of founder's passion\n   - Identifying and solving specific problems\n   - Case study: Airbnb\n2. The Importance of Execution(Turning ideas into reality)\n   - Execution over ideation\n   - Case study: Facebook\n3. Strategic Pivoting (Adapting to find market fit)\n   - Importance of pivoting towards a goal\n   - Case study: Twitter\n4. Evaluating Long-Term Value (Ensuring sustainability)\n   - Sustainability through long-term value\n   - Case study: Amazon\n5. Future Planning (Anticipating future challenges)\n   - Strategic foresight and adaptability\n   - Case study: Slack",
        "Week 2": "Growth Strategies\n1. SEO Strategies (Driving organic traffic)\n   - Keyword research\n   - Link building\n2. Email Marketing (Engaging users effectively)\n   - Personalized notifications vs. newsletters\n   - Deliverability and engagement\n3. Triggered Marketing Campaigns(Boosting engagement)\n   - User action-based campaigns\n   - Boosting click-through rates\n4. Virality Factors (Achieving rapid growth)\n   - Payload, frequency, and conversion rates\n5. Creating Products Users Love (Fostering user loyalty)\n   - Conversion rates and churn indicators\n   - Case study: Apple",
        "Week 3": "Building Culture and Strategic Management\n1. Hiring and Team Building (Creating a strong foundation)\n   - Values: hard work, integrity, creativity, transparency\n   - Hiring the first 10 employees\n2. Transparency and Onboarding(Fostering open communication)\n   - Tooling for transparency\n   - Evolving onboarding processes\n3. Managing People and Resources(Maximizing organizational output)\n   - Effective leadership and decision-making\n   - Regular one-on-one meetings\n4. Metrics and Outputs (Measuring performance accurately)\n   - Focusing on outputs\n5. Fairness and Cultural Implications(Ensuring equitable practices)\n   - Considering all stakeholders\n   - Structured processes for raises",
        "Week 4": "Project - At the end of the course the participant is expected to have a basic understanding on the workings and analysis of startups. The course will conclude with a submission of BMC i.e. a Business Model Canvas. The BMC should be on the startup idea the participant has developed through the course or otherwise on an alum startup.",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Management Summer School (Courses in Consult, Finance, Entrepreneurship, Economics*)",
        "School ID": "2",
        "Course ID": "22",
        "Course Name": "Ai in Entrepreneurship",
        "Club": "EnB Club",
        "Desc_short": "Unlock the power of AI to launch your startup idea, no coding, just creativity, tools, and strategy!",
        "Desc": "This 4-week course introduces students to the intersection of entrepreneurship and artificial intelligence. You’ll learn how to ideate, validate, build, and scale a startup using practical AI tools. Each week focuses on a new stage of the entrepreneurial journey—from understanding the startup lifecycle and market research to building MVPs with no-code AI platforms and preparing AI-powered pitch decks. Through engaging lectures, hands-on assignments, and real-world case studies, you'll walk away with a complete startup concept powered by AI.",
        "Week_time": "3–5 hours",
        "Evaluation": "Total: 100%\n\nWeekly Assignments (4) — 50%\nShort tasks where students apply weekly concepts using AI tools (e.g., market research using ChatGPT, MVP design using no-code platforms).\n\nFinal Project — 50%\nStudents submit a complete AI-powered startup pitch deck, including idea validation, product concept, GTM strategy, and ethical use of AI.",
        "Certification": "Minimum 60% overall score (assignments + final project), Submission of all weekly assignments and final project",
        "Pre-req": "Basic familiarity with startups, business ideas, or willingness to explore new tools",
        "Contact info": "Ishant (8512094092)",
        "Week 1": "Introduction to Entrepreneurship & Foundations of AI\n\nUnderstanding the entrepreneurial mindset and the startup lifecycle\n\nOverview of AI and machine learning (no technical background needed)\n\nApplications of AI in real-world businesses\n\nAI in the startup landscape: opportunities and examples\n\nHands-on: Explore ChatGPT, Notion AI, and other beginner-friendly tools\n\nAssignment: Identify a problem, propose an AI-based solution, and validate the idea using AI tools (e.g., ChatGPT, Google Trends)",
        "Week 2": "AI for Market Research & Opportunity Identification\n\nUsing AI tools for market research and trend analysis\n\nCustomer persona creation and segmentation with AI assistance\n\nCompetitive landscape mapping using AI scrapers and research assistants\n\nTools: Browse AI, ChatGPT, Perplexity AI, Similarweb\n\nAssignment: Submit a 1-page market research report and customer persona using at least two AI tools",
        "Week 3": "Building MVPs and Prototypes with AI & No-Code Tools\n\nUnderstanding MVPs and product-market fit\n\nIntroduction to no-code tools (Bubble, Glide, Canva, Figma, Tally)\n\nIntegrating AI APIs or models into your startup idea\n\nCase studies: Jasper AI, Copy.ai, Looka, Synthesia\n\nAssignment: Build a prototype or visual MVP of your idea using AI/no-code platform",
        "Week 4": "Scaling, Pitching & Ethical AI Use\n\nUsing AI in sales, marketing, and customer support automation\n\nCreating AI-powered pitch decks and fundraising strategies\n\nTools: Beautiful.ai, ChatGPT for scripting, Decktopus, SlidesAI\n\nDiscussion: Responsible use of AI, ethics, bias, and data privacy\n\nAssignment: Submit a complete AI-powered startup pitch deck including MVP, GTM strategy, AI use case, and ethical considerations",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Management Summer School (Courses in Consult, Finance, Entrepreneurship, Economics*)",
        "School ID": "2",
        "Course ID": "23",
        "Course Name": "Consulting 101",
        "Club": "Consult Club",
        "Desc_short": "Discover the power of consulting with our Consulting 101 course! Are you ready to unlock your potential and dive into this exciting field? Whether you're a beginner or completely new to consulting, our course equips you with essential skills and knowledge to excel. Learn problem-solving, master strategic thinking, and develop communication skills that set you apart as a trusted advisor. Plus, delve into guesstimates—a critical skill for any consultant—enabling you to break down complex problems and provide quick, insightful estimates on the spot. Join us and transform your consulting journey!",
        "Desc": "Consulting 101 encompasses a comprehensive introduction to the world of consulting providing students a great exposure to what consulting really is about. This program would help to develop essential skills such as structuring thoughts, generating ideas, and making guesstimates, which are the tools that consultants use on a daily basis, without which they wouldn't be who they are. Through interactive sessions, shared content and a project-based assignment, participants shall gain practical exposure to consulting concepts and real-life case studies covering profitability analysis, market entry strategies, and mergers and acquisitions. The course would serve as an excellent way for anyone looking for exposure to consulting to achieve that.\n",
        "Week_time": "4-6 hours",
        "Evaluation": "Originality – Work must be AI-free and authentically written by the student. (This is must to follow otherwise your assignment will not be considered for evaluation)\n\nRelevance (40%) – Content must directly reflect the concepts taught in that week's syllabus.\n\nStructure (40%) – Clear, logical organization with proper flow and formatting.\n\nCreativity (20%) – Demonstrates critical thinking, originality, and insightful perspectives.",
        "Certification": "Attend at least 2/3 live sessions. Submit at least 2/3 assignments/ projects before the resume deadline. Obtain more than 50% in the assignments given till now.",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Karan (9833729353), Parv (7304921051)",
        "Week 1": "What is Consulting, Types of Consulting\nIntroduction to Guesstimates, guesstimate examples\nIssue trees: what are issue trees, how to make an issue tree, examples\n",
        "Week 2": "What is critical thinking? it’s importance in consulting, resources to improve your critical thinking\nSWOT analysis and Pestel analysis\nWhat is problem identification and framing? Problem solving frameworks, MECE principle\nCreative and Innovative thinking\n",
        "Week 3": "Introduction to profitability, solving case interviews on profitability\nIntroduction to Competitive Analysis and analyzing business through unpredictable market forces\nGrowth Strategy and Management, solved cases\nMergers and Acquisitions, examples\n",
        "Week 4": "NA",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "11",
        "Course Name": "SYN-BIO 101",
        "Club": "iGEM",
        "Desc_short": "Step into the revolutionary field of Synthetic Biology where DNA becomes your code and cells your canvas. In just 4 weeks, learn how to engineer life, create biological circuits, and reimagine the future of medicine, energy, and more.",
        "Desc": "This Introduction to Synthetic Biology course is your gateway to understanding how we can program living systems like machines. You'll explore how DNA, RNA, and proteins work together and how we can manipulate this flow of information to engineer biological circuits and solve real-world problems. Through this course, you'll learn how to differentiate synthetic biology from traditional genetic engineering, design and analyze gene expression systems, understand tools like CRISPR, and explore applications in medicine, sustainability, and biomaterials. You'll also get hands-on exposure to bioinformatics tools like the RCSB PDB Viewer, develop an understanding of biotechnology techniques such as recombinant DNA and PCR, and think critically about ethics, biosafety, and innovation in this fast-growing field. Whether you're passionate about biology, tech, or innovation — this course will help you explore the future of life sciences.",
        "Week_time": "3-4 hours",
        "Evaluation": "Each week, you will complete an assignment comprising:\nObjective Questions: Multiple-choice, True/False, and short-answer questions to test your conceptual clarity.\nSubjective Questions: Logic-based, open-ended questions where you’ll apply what you’ve learned to solve synthetic biology problems.\nIn the final week, you will complete a mandatory project using the RCSB PDB Viewer to analyze protein structures. You'll be expected to interpret structural features, identify functional insights, and derive meaningful conclusions from your analysis. Completion of this project is compulsory for certification",
        "Certification": "60% in the weekly assignment & completion of the final project.",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Gaurish (9766206523), Hitesh (7977016916)",
        "Week 1": " Foundations of Synthetic Biology-what syn bio and how its differernt from geneticengineering,historical lmilestones and breakthoughs, designing principles in biological circuits, and real world applications",
        "Week 2": "The Genetic Toolkit- understanding the central dogma, deep dive into replication, transcription, and translation.Post-transcriptional and post-translational modifications.\nIntroduction to gene expression control & synthetic varients.",
        "Week 3": "Biotechnology Essentials- Core techniques: Recombinant DNA, cloning vectors, plasmids, and gel electrophoresis.gene delivery methodsPCR, gene amplification, and identifying recombinant colonies, vector systems, bioreactors, and downstream processing.",
        "Week 4": "Advanced Applications & Bioethics- Genetic circuit design: Build logic into cells. CRISPR: The genome editing revolution.biosafety, biosecurity, and intellectual property in synbio.\n",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "12",
        "Course Name": "Computational Soft and Active Matter: Modeling Self-Organisation and Collective Behavior",
        "Club": "Students' Association of Physics Department",
        "Desc_short": "From particles to patterns—simulate how flocks form, clusters jam, and agents organise in motion! Build your own soft and active matter simulations from scratch",
        "Desc": "This course offers an  introduction to computational modeling of soft and active matter systems, where students explore how complex collective behaviors emerge from simple rules. Over four weeks, learners will build interactive simulations using Python to investigate phenomena like clustering, jamming, and flocking.\n\nWeek 1 introduces particle dynamics and repulsive forces in soft matter systems.\n\nWeek 2 explores inter-particle potentials and self-organization, modeling systems like foams and colloids.\n\nWeek 3 dives into active matter, implementing the Vicsek model to simulate flocking and noise-driven phase transitions.\n\nWeek 4 brings it all together in a capstone-style project, modeling flocking agents navigating through obstacles using alignment, repulsion, and self-propulsion.\n\nStudents will use Python and libraries like numpy and matplotlib to visualize behaviours in real time. \n\nBy the end of the course, learners will have built their own simulation engines, developed insights into self-organization, and created a final project showcasing their understanding of soft and active matter systems.",
        "Week_time": "6-7 hours",
        "Evaluation": "Attendance: 75% required\nWeekly Assignments (60%)\nCapstone Project (40%)\nPassing Criteria: Minimum 50% overall to pass",
        "Certification": "75% attendance, out of 3 assignments one can be left, capstone project is must and 50% grades in assignments depending on code quality ",
        "Pre-req": "Some experience with Python (especially numpy and matplotlib)",
        "Contact info": "Ananya Priyaroop (9835045678)",
        "Week 1": "Course Content:\nIntegration methods: Euler, Velocity Verlet\nSoft repulsion using Lennard-Jones-like potential\nBoundary handling: reflective and periodic\nEnergy conservation basics\n\nAssignment 1:\nSimulate 100 particles in 2D with soft repulsion\nImplement both Euler and Velocity Verlet methods\nPlot total kinetic + potential energy over time\n\nSubmit:\nPython code\n20s animation\nEnergy vs time plot",
        "Week 2": "Course Content:\nClustering, aggregation, jamming phenomena\nAttractive-repulsive potentials (modified Lennard-Jones)\nSpatial metrics: pairwise distances, cluster sizes\nConcepts of equilibrium vs non-equilibrium systems\n\nAssignment 2:\nSimulate for 3 interaction strengths and 3 densities\nCalculate:\nCluster size distribution\nRadial distribution function \nSubmit:\nPlots of clustering metrics\nSnapshot comparisons pre/post clustering\n\nBrief report on clustering behavior vs parameters",
        "Week 3": "Course Content:\n\nVicsek model: self-propulsion + local alignment + noise\nOrdered vs disordered states\nOrder parameter \nInfluence of noise and density\n\nAssignment 3:\nSimulate 50 agents at low, medium, and high noise\nTrack:\nOrder parameter over time\nParticle trajectories\n\nSubmit:\nAnimation showing flocking transition\nPlot of ϕ vs time for each noise level\nReport on noise thresholds and order-disorder behavior",
        "Week 4": "Course Content:\nCoupling Vicsek model with soft repulsion\nAdding static obstacles as repelling objects\nMeasuring density, energy, order",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "13",
        "Course Name": "Foundations of Astronomy and Astrophysics",
        "Club": "Krittika",
        "Desc_short": "One might wonder why, when and how we and the objects around us came into being. We might have found answers to some of these questions, but our understanding of the cosmos is still quite limited. One might be curious and want to explore this branch of Science. This Learners' Space course will provide a foundation in Astronomy and Astrophysics with a wide range of modules covering the basic workings of Celestial objects and their phenomena, Telescopes and also methods of studying as well as detecting these objects.",
        "Desc": "The course intends to build a basic understanding of the fundamentals of Astronomy and Astrophysics like Celestial Mechanics, Working of telescopes, Radiation & its Use in Astrophysics and Telescopes. Once the fundamentals are all set, we take a step further and dive deeper into the advanced modules. The advanced modules offer a variety of topics like Cosmology, Distance Ladder, Exoplanet Detection, Multi-messenger Astronomy, Radio Astronomy, Solar Physics and Stellar Structure and Evolution, which one can take up according to their interest. If you love Astronomy and want to learn but don't know how; this is a great opportunity!   ",
        "Week_time": "4-5 hours",
        "Evaluation": "Certificate Assignment \nattendance in lectures\nmini-quizzes",
        "Certification": "Certificate Assignment should be completed at least 50% lectures attended at least 25% mini quizzes attempted",
        "Pre-req": "None",
        "Contact info": "Vihaang (9527958679), Durva (9009911322)",
        "Week 1": "Celestial Mechanics and Gravity\nCoordinate Systems and Time",
        "Week 2": "Radiation & its use in Astrophysics\nTelescopes",
        "Week 3": "(Any 2 out of the 7 advanced modules to be done in week3 as well as week4)\nCosmology\nDistance Ladder\nExoplanet Detection",
        "Week 4": "Multi-messenger Astronomy\nRadio Astronomy\nSolar Physics\nStellar Structure and Evolution",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "14",
        "Course Name": "Introduction to Quantum Computing",
        "Club": "Maths and Physics Club",
        "Desc_short": "Quantum computing is a field that harnesses the principles of quantum mechanics to process information. This course introduces the foundational concepts of quantum mechanics relevant to computing, explores the specialized hardware and algorithms used in quantum systems, and highlights how scalable quantum computers can solve certain problems exponentially faster than their classical counterparts. Join this course to learn more about it!",
        "Desc": "Quantum computing is a field that harnesses the principles of quantum mechanics to process information. Unlike classical computers that use bits represented by transistors, quantum computers use quantum bits (qubits), which can be realized even by single atoms under specific constraints. At the quantum scale, matter behaves both like particles and waves, enabling powerful new ways to perform computation. This course introduces the foundational concepts of quantum mechanics relevant to computing, explores the specialized hardware and algorithms used in quantum systems, and highlights how scalable quantum computers can solve certain problems exponentially faster than their classical counterparts.",
        "Week_time": "6 hours",
        "Evaluation": "3 Assignments, one per week: Each has 20% Weightage\nMini Project on Implementation of Algorithms: 40% Weightage",
        "Certification": "Assignments and Mini Project",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Soham (8602586808)",
        "Week 1": "1. Linear Algebra: Dirac Notation, Duals, Inner products and Hilbert Spaces, Outer product, Operators and States, Adjoint of an operator, Hermitian, Unitary and Positive Operators, Unitary Diagonalization, Tensor Product, Partial Trace.\n2. Postulates of QM: State Space, Evolution, Measurement (Protective and POVM), Composite systems.\n3. Qiskit - Setup and Basics, Bloch sphere visualization.",
        "Week 2": "1. Gates: Pauli X,Y,Z, Hadamard, S, T, General Rotation, Multi-qubit gates (CNOT, General Controlled Unitary, Swap, Toffoli) \n2. Circuits: Basic operational circuits, Superdense Coding, Teleportation circuits\n3. Primitives: Phase Kickback, Pre-image States.",
        "Week 3": "1. Primitives(Contd.): Quantum Fourier Transform\n2. Algorithms: Grover's, Shor's, Simon's, Deutsch-Josza",
        "Week 4": "1. Implementing Algorithms in Qiskit: Grover's, Shor's, Simon's, Deutsch-Josza in Qiskit.\n2. Introduction to Quantum Information",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "15",
        "Course Name": "Information and Coding Theory",
        "Club": "Maths and Physics Club",
        "Desc_short": "Ever wondered what is the science behind efficient and reliable communication!? Answer lies in Information & Coding Theory. This course is catered to cover the essentials of information and coding theory; from entropy and data compression to error-correcting codes. Join in this course to learn, how modern systems transmit data accurately, even in noisy environments.",
        "Desc": "From bits to error-proof messages, the course covers the fundamentals of information and coding theory. In the first half, study about probability, entropy, and the ideas of Claude Shannon that revolutionized how we understand information. In the second half, explore the art of communication—learn how to compress data efficiently and correct errors with powerful coding techniques like Huffman, Hamming, and Reed–Solomon codes. Blending theory with systems like QR codes and ISBNs, the course act as a introduction to source and channel coding, equipping you with the tools to understand modern digital communication.",
        "Week_time": "7-9 hours",
        "Evaluation": "Week 1: One assignment, worth 20%\nWeek 2: One assignment, worth 30%\nWeek 3: One assignment, worth 20%\nWeek 4: One assignment, worth 30%",
        "Certification": "Score of 70% is required across all assignments",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Nirav (9511896571)",
        "Week 1": "Basic probability (random variables, distributions and densities, expectations), some statistical results (inequalities of Markov and Chebyshev (with proof), weak and strong law of large numbers (without proof)), basics of entropy (Shannon information content, decomposability, bounds, asymptotic equipartition, typical sets) ",
        "Week 2": "More on entropy (joint, conditional, and relative entropies, mutual information, Gibbs' inequality, chain rules, data processing inequality), Shannon's source coding theorem (with proof), basics of channels and channel capacities, Shannon's noisy channel coding theorem (without proof)",
        "Week 3": "Introduction to Coding Theory (Source and Channel Coding)\n\nHistorical motivation: Need for efficient and error-free communication\n\nSource Coding:\nMorse Code, ASCII encoding\nHuffman encoding (construction, optimality proof)\n\nChannel Coding:\nIntroduction to encoding and decoding processes\nISBN numbers and check-digit schemes\nQR code structure and encoding principles\nBasic concepts of error detection and correction\n\nDiscussion on the distinction and interplay between source coding and channel coding",
        "Week 4": "Linear Codes:\nDefinitions (block codes, linearity, generator and parity-check matrices)\nEncoding and syndrome decoding\n\nHamming Codes:\nConstruction, minimum distance, error detection and correction capability\n\nReed–Solomon Codes:\nBasics of finite fields and polynomial interpolation\nEncoding and decoding overview\n\nReed–Muller Codes:\nBoolean functions, recursive construction\nApplications and decoding idea\n\nGeometric and algebraic perspectives in modern coding",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "16",
        "Course Name": "Game Theory",
        "Club": "Maths and Physics Club",
        "Desc_short": "Step into the world of rational decision-making by learning the fundamentals of Game Theory in this wonderful course! Take your first steps toward this deeply strategic field that shapes economics, politics, biology, and everyday life and uncover the principles behind how rational individuals make decisions.",
        "Desc": "Step into the world of strategic thinking with this introductory course on Game Theory. Across four weeks, you'll explore rational decision-making through iconic games like the Prisoner’s Dilemma, delve into Nash equilibria in both pure and mixed strategies, and understand how fairness and efficiency play into group decisions. The course wraps up with Arrow’s Impossibility Theorem, revealing the mathematical limits of democratic systems. By the end of this course, you’ll have taken strong leap into the strategic mindset that shapes economics, equipping yourself with essential tools to make rational decisions in complex scenarios",
        "Week_time": "3 hours",
        "Evaluation": "25% Each for 4 weeks",
        "Certification": "Should score above 70% across the course",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Soham (8602586808), Nirav (9511896571)",
        "Week 1": "We begin with the motivation behind game theory by exploring classic examples like chess. Know the classic Prisoner’s Dilemma through normal form games and discover the fundamental idea of rationality.",
        "Week 2": "Go deeper into the structure of normal form games. Learn about domination, Nash equilibrium, focusing on Pure Strategy Nash Equilibria (PSNE) and what it mean.",
        "Week 3": "Learn the concept of Mixed Strategies, The fundamental idea behind Mixed Strategy Nash Equilibria (MSNE), Prove the existence of MSNE, Start exploring the idea of Social Welfare Functions (SWF)",
        "Week 4": "Wrap up by exploring Arrow's Social Welfare Setup, introduce fairness notions such as Pareto Efficiency (PE) and Independence of Irrelevant Alternatives (IIA), Conclude with proving how democracy is mathematically impossible (Arrow's Impossibility Theorem)",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "17",
        "Course Name": "Introduction to Astronomical Image Processing",
        "Club": "Krittika",
        "Desc_short": "Even though the Universe appears to be beyond our reach, it communicates with us, giving us information through electromagnetic radiation. Astronomical Imaging teaches us how to gather and interpret this information. This learner’s space course will explain its workings and teach you how to process those famous images from Hubble and the JWST.",
        "Desc": "The course covers the principles of imaging systems while providing an overview of astronomical imaging techniques. You’ll learn more about multiwavelength imaging and work with data from ground-based telescopes, Hubble, JWST, and more, while doing comparative analysis. The main focus will be on learning image processing and the science behind it.\nIf you are an astrophile like the people in Krittika but haven’t had the opportunity to learn how to process raw data and delve deep into its workings, this is the perfect opportunity for you!",
        "Week_time": "6-7 hours",
        "Evaluation": "Small weekly quizzes - module wise\nFinal Processing assignment with a quiz",
        "Certification": "Completion of processing assignment and attendance of more than 50% in the live processing sessions",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Ruhaan (8805375670)",
        "Week 1": "Module 1: Introduction to imaging Systems\nModule 2: containing topics about thermal and non-thermal emission,Reading data from various telescopes like JWST, Hubble etc. ",
        "Week 2": "Image processing session 1(Planets or Moon)-Live online session\nModule 3: Light detection, photon noise,flux magnitude and basics of CCDs(Charge coupled devices)",
        "Week 3": "Deep Sky Image processing session 1-Live online session\nModule 4: Basics of Image processing techniques, Seeing and Scintillation",
        "Week 4": "Deep Sky Image processing session 2-Live online session\nModule 5 : Spectroscopy and photometry ",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "18",
        "Course Name": "Evolution 101",
        "Club": "BioX Club ",
        "Desc_short": "Explore how life began, how species change, and how humans fit into the grand evolutionary puzzle. This course blends ancient Earth history with cutting-edge genetics, real-world examples like antibiotic resistance, and powerful tools like Python and BLAST to decode life’s story. Whether you're into fossils, DNA, or digital biology — EvoQuest offers a thrilling dive into the science that connects us all.",
        "Desc": "EvoQuest is an immersive journey through the science of evolution — from life’s earliest molecular origins to the genetic and cultural evolution of humans. This course blends classical evolutionary theory with cutting-edge molecular biology, computational tools, and real-world applications to give you a comprehensive and hands-on understanding of life’s dynamic history.\n\nYou’ll explore how life may have first emerged from non-living chemistry, uncover the evolutionary milestones revealed by fossils and comparative anatomy, and examine the genetic mechanisms that drive diversity and change over time. Core topics include natural selection, mutation theory, speciation, adaptive radiation, and coevolution, all backed by real-world case studies such as antibiotic resistance, pesticide adaptation, and the evolutionary success of Darwin’s finches.\n\nBut EvoQuest goes far beyond theory — you'll also gain practical skills in bioinformatics, learning the basics of Python and Biopython, exploring sequence databases, and using tools like BLAST to analyze genetic data. You’ll learn how scientists build and interpret phylogenetic trees, estimate evolutionary divergence times, and assess the reliability of evolutionary hypotheses using techniques like bootstrapping.\n\nWe’ll also dive into groundbreaking fields such as epigenetics, where inheritance is not just about DNA, and evolutionary medicine, which reveals how evolutionary principles apply directly to human health and disease.\n\nWhether you're passionate about the origins of life, fascinated by genetics, or looking to apply computational tools in biology, EvoQuest equips you with the knowledge and skills to explore evolution from every angle.\n\ntools used are:\n\nPython Programming (Basics)\nBiopython\nNCBI Databases\nBLAST (Basic Local Alignment Search Tool)\nSequence Alignment Tools \n Phylogenetic Tree Construction & Analysis",
        "Week_time": "5 hours",
        "Evaluation": "Each week will conclude with an assignment based on that week’s topics to reinforce learning and track progress.project overview:Build a simple evolutionary tree using DNA data to explore how species are related. You'll use tools like NCBI, BLAST, ClustalW, MEGA X, and Biopython.\nrefine it",
        "Certification": "70% in assignments and project completion",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Adwai (8019831015), Reet (8087038860), Jovita (8657467118)",
        "Week 1": "Foundations of Evolution\n1) Origin of Life\n•        Abiogenesis\n•        Oparin-Haldane Theory\n•        Miller-Urey Experiment\n2) Chemical Evolution\n•        Prebiotic Chemistry\n•        RNA World Hypothesis\n3) Geological Time Scale\n•        Eons, Eras, and Key Events in Earth’s History\n4) Evidences of Evolution\n•        Fossils\n•        Comparative Anatomy\n•        Embryology\n•        Molecular Biology\n5) Darwinism\n•        Natural Selection\n•        Peppered Moth Case\n6) Mutation Theory\n•        Role of Mutations\n•        Causes\n•        Effects\n•        Examples\nAdditional Topics:\n1.        Extremophiles & Early Life\n•        How Extremophiles Inform About Early Life?\n2.        Fossil Record Analysis\n",
        "Week 2": "Mechanisms of Evolution\n1) Modern Synthetic Theory\n•        Combining Genetics + Darwinism\n2) Hardy-Weinberg Principle\n•        Equilibrium\n•        Allele Frequencies\n3) Speciation\n•        Allopatric Speciation\n•        Sympatric Speciation\n•        Polyploidy\n4) Adaptive Radiation\n•        Darwin’s Finches\n•        Hawaiian Silverswords\n5) Mechanisms of Organic Evolution\n•        Gene Flow\n•        Genetic Drift\n•        Population Bottlenecks\nAdditional Topic:\n1.        Neutral Theory of Evolution\n",
        "Week 3": "Speciation and Adaptation\n1) Coevolution\n•        Mutualism\n•        Predator-Prey Arms Races\n2) Python Basics\n3) Biopython Introduction\n4) Sequence Databases & BLAST\n5) Sequence Alignment Concepts\nAdditional Topic:\n1.        Epigenetics & Evolution\n•        Non-Genetic Inheritance Mechanisms\n",
        "Week 4": "Human Evolution & Applied Evolution\n1) Human Evolution\n•        Hominin Lineage\n•        Genetic and Cultural Evolution\n2) Applied Evolution\n•        Antibiotic Resistance\n•        Pesticide Resistance\n•        Conservation Genetics\n3) Evolutionary Medicine\n4) Constructing Phylogenetic Trees\n5) Divergence Time Estimation\n6) Tree Reliability: Bootstrapping\n",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sports and Skills Summer School",
        "School ID": "4",
        "Course ID": "41",
        "Course Name": "Analyzing the Impact of IPL Player Performance on Salaries using Machine Learning",
        "Club": "Institute Sports Council",
        "Desc_short": "Ever wondered how to avoid a ₹27 Crore mistake like LSG did?\nWant to make sure your future IPL team doesn’t end up burning crores on underperformers, here’s your chance to crack the code of predicting player salaries based on performance – and learn how to bid smart at the auction table!\nDon't miss out – this is where data meets cricket, and crores are either made or lost.",
        "Desc": "Course Overview:\nThe IPL auction is a high-stakes battlefield where crores are spent in minutes. But what separates a smart bid from a ₹27 crore mistake (yes, we’re looking at you, LSG)? This course is designed to help you decode the science behind auction dynamics, understand performance metrics, and build predictive models to estimate player salaries — so you can bid like a pro, not just a fan.\n\n#What You'll Learn:\n1) Fundamentals of Performance Analytics: Learn what stats truly matter – batting averages, strike rates, economy, consistency metrics, match context, and more.\n2) Building Predictive Models: Dive into machine learning and regression techniques to forecast a player’s value using historical data.\n3) Decoding Auction Strategy: Understand team compositions, auction behavior, role scarcity, and how hype impacts pricing.\n4) Case Study: The ₹27 Crore Gamble: Deep-dive into Lucknow Super Giants’ investment in Rishabh Pant – analyzing the expectations, performance, and data behind the debate.\n5) Market Value vs. Intrinsic Value: Learn how to spot undervalued gems and avoid overpriced traps.\n\n# Tools You’ll Use:\nPython (Pandas, NumPy, Scikit-learn)\nExcel / Google Sheets for quick analysis\nIPL and T20 player datasets\nVisualization tools (Matplotlib / Seaborn / Tableau optional)",
        "Week_time": "20-25 hours",
        "Evaluation": "4-week course having 4 assignments, the first 3 assignments are of 60% weight and the final assignment is for 40% weight. The assignments would be basics of data science, python and machine learning. The final project would compromise of combining all the learnings and making the model to predict the salaries for auction-2026.",
        "Certification": "Minimum 2 of 3 assignment submission and final project is mandatory",
        "Pre-req": "Basic Python is recommended ",
        "Contact info": "Aryansh Kukreja (9992888093)",
        "Week 1": "Data Collection & Preprocessing\nGoal: Build a clean dataset of IPL player statistics and salaries ready for modeling.",
        "Week 2": "Model Building\nGoal: Train regression models to predict salary using player performance data.",
        "Week 3": "Feature Importance & Insights\nGoal: Understand and explain what features most influence predicted salary.",
        "Week 4": "Deployment & Final Report\nGoal: Wrap up, optionally deploy, and write a professional project report.",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sports and Skills Summer School",
        "School ID": "4",
        "Course ID": "42",
        "Course Name": "VisionAthlete: AI-Powered Sports Biomechanics",
        "Club": "Institute Sports Council",
        "Desc_short": "Use computer vision to analyze the biomechanics of specific sports movements—such as a snatch in weightlifting, a spike in volleyball, a tennis serve, a golf swing, or a baseball pitch—by extracting pose data from videos. Generate an efficiency or accuracy rating by comparing the technique to expert models or ideal biomechanical patterns.",
        "Desc": "This project focuses on using computer vision to perform biomechanical analysis of specific, well-defined sports movements in order to assess the efficiency and accuracy of an athlete’s technique. By targeting actions such as a snatch in weightlifting, a volleyball spike, a tennis serve, a golf swing, or a baseball pitch, the system analyzes video footage to extract body pose data using pose estimation tools like OpenPose, MediaPipe, or DeepLabCut. From this data, it calculates key biomechanical metrics such as joint angles, body alignment, timing, and symmetry. These features are then compared to expert performance models or biomechanical standards to generate an efficiency or accuracy rating. The goal is to provide athletes and coaches with objective, data-driven feedback that can be used to improve performance, reduce injury risk, and monitor technique over time. With potential applications in coaching, rehabilitation, and athlete development, the system can be extended to support real-time feedback, multi-angle video analysis, or integration with wearable sensors for even deeper insights.",
        "Week_time": "3-4 hours",
        "Evaluation": "Project-  Build a mini “AI Sports Coach” that analyzes a short video of a sports movement (e.g., a tennis serve, volleyball spike, or squat) using pose estimation and compares it to an expert model to generate a basic performance score and improvement tips.",
        "Certification": "Completion of the project",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Nehal Gupta (8291025201)",
        "Week 1": "Understand basic sports biomechanics\nIntroduction to computer vision\nLearn about pose estimation\n\n",
        "Week 2": "Understand keypoints and pose data\nExtract biomechanical features: joint angles, symmetry, body alignment",
        "Week 3": "Compare athlete pose data with expert reference\nCreate scoring metrics for accuracy or efficiency\nGenerate visual & textual feedback",
        "Week 4": "Integrate all components into a final working system\nPolish and present the project\n",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sports and Skills Summer School",
        "School ID": "4",
        "Course ID": "43",
        "Course Name": "Automatic Chess Bot design",
        "Club": "Institute Sports Council",
        "Desc_short": "Want to code like a pro and outplay your friends at chess? This short, engaging course teaches you how to build your own chess-playing bot from scratch! Learn the basics of Python, chess logic, game engines, and AI decision-making all while having fun. The necessary theory, and lots of hands-on coding, strategy, and real results on the board.",
        "Desc": "This Chess Bot Coding Course takes you from beginner to builder as you create your own fully functional chess-playing AI. The course starts with a simple setup process: installing Python, VS Code, and the python-chess library, while introducing you to what a chess bot is and where it's used in the real world. Next, you'll dive into the basics of chess from a programmer's perspective: understanding the board, piece movements, legal moves, and how they're represented in code using notations like FEN and PGN.\n\nOnce the foundations are set, you’ll build a command-line based chess engine where a human can play against the bot. You'll begin with a basic random-move bot, then gradually enhance it using evaluation functions that count material and favor stronger positions. The course then dives into real AI logic, implementing the Minimax algorithm and optimizing it with Alpha Beta Pruning to make your bot smarter and more competitive.\n\nFor those interested in visual interfaces, the course includes an optional GUI section using pygame or tkinter, allowing you to add drag and drop functionality and display the chessboard visually. You'll also learn how to connect your bot to online platforms like Lichess using their API, enabling it to play games in real time on the internet.\n\nThe course concludes with a final project where you'll customize your bot’s strategy and personality, whether defensive, aggressive, or balanced, and test it against both human players and other bots. Throughout the course, you’ll gain practical experience in Python, game logic, AI decision-making, and real-world software development, all while having fun building something meaningful.",
        "Week_time": "8 hours",
        "Evaluation": "Week 1: Implement chessboard representation and legal move generation for basic pieces (pawns, knights). (20%)\n\nWeek 2: Develop move execution, update board states, and detect game-ending conditions like check and checkmate. (20%)\n\nWeek 3: Build a Minimax search algorithm with a simple board evaluation function to enable basic AI decision-making. (20%)\n\nWeek 4: Integrate all components into a full chess bot, test gameplay, debug edge cases, and reflect on improvements. (40%)",
        "Certification": "A grade of atleast 60%",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Prateek (6297957507)",
        "Week 1": "Introduction to chess bots and course overview\n\nInstalling Python, VS Code, and the python-chess library\n\nBasic Python programming essentials: variables, functions, loops\n\nUnderstanding the chessboard, pieces, and moves programmatically\n\nLearning chess notation (FEN and PGN) and legal move generation\n\nWriting simple scripts to create and display a chessboard with moves",
        "Week 2": "Developing a command-line chess game where a human can play moves\n\nImplementing move validation and turn management\n\nCreating a simple bot that makes random valid moves\n\nIntroduction to evaluation functions: material count basics\n\nEnhancing the bot to pick moves based on material advantage\n\nTesting and debugging game flow",
        "Week 3": "Understanding the Minimax algorithm and decision trees\n\nCoding Minimax to evaluate moves several steps ahead\n\nLearning and applying Alpha-Beta pruning to optimize Minimax\n\nImproving the bot’s move quality and response time\n\nIntroducing adjustable difficulty levels based on search depth\n\nTesting bot strength and behavior with different settings\n\n",
        "Week 4": "(Optional) Building a simple GUI with pygame or tkinter to visualize the board\n\nAdding user interaction: drag-and-drop or click-to-move\n\nIntegrating the AI bot logic with the GUI for smooth gameplay\n\nConnecting your bot to online platforms like Lichess via API (overview)\n\nFinal project: customize your bot’s strategy and test against players or bots\n\nTips for further learning and improvement",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sports and Skills Summer School",
        "School ID": "4",
        "Course ID": "44",
        "Course Name": "Journalistic Writing",
        "Club": "English Learning Program",
        "Desc_short": "Explore Journalism: Learn to Write News, Engaging Stories, and Opinion Pieces. Discover the Power of Your Words!",
        "Desc": "In this Journalism course, students will cover a lot of ground across four sections. First, they'll learn the basics like how to write news, conduct interviews, make surveys, and understand bias in reporting. Then, they'll move on to feature writing, where they'll see how to write engaging stories on serious, educational, and sensitive topics. After that, they'll dive into long-form journalism, studying great examples and learning how to dig deep into a story. Finally, they'll wrap up with op-eds, focusing on writing persuasive pieces about social issues without getting too political. Throughout the course, we'll highlight the importance of telling stories in a captivating way and using different media tools effectively. \nThis course in journalism offers essential skills for effective communication across various fields. From news writing and conducting interviews to understanding bias and crafting engaging narratives, it equips you with tools applicable in journalism, content creation, public relations, and more. With a focus on research, critical thinking, and ethical considerations, it prepares you to navigate and contribute to media landscapes responsibly. Whether you're pursuing a career in journalism or seeking to enhance your communication abilities, this course provides valuable knowledge and practical tools for success.",
        "Week_time": "3-4 hours",
        "Evaluation": "Assignment at the end of week 1: \n-News/article analysis\n-Interview questionnaire making/modification of previously made questionnaire\n-Relevant survey design\n2nd week: Based on the survey results, they will write a feature report explaining the outcomes, they can mention any similarities or causes for the outcomes.\n3rd and 4th week: Assignments add up to the final project i.e. writing an article. ",
        "Certification": "Completing all the assignments and the final project, as well as attending at least 3 out of 4 webinars.",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Aarya Gaikwad (9322729792), Aditya Rana (9692894061), Ayush Jaiswal (7974399532), Gouri Namdeo (7977028289), Goutam Singh (9340703592), Rishit Kesharwani (9799158677)",
        "Week 1": "Introduction to Journalism:\n Basic lesson on news writing (how to approach/write news)\nHow to take interviews?\n Survey design\n Journalism bias and ethics\nDocumentary analysis",
        "Week 2": "Will be  presenting  2 or 3 examples of how feature writing can be used to explain a serious topic, educational topic and sensitive topic and anything else as well. Will guide on how to write an engaging narrative  and how they can possibly include in their final project.",
        "Week 3": "What is long-form journalism? What kind of topics are covered in long-form journalism? Analysis of examples - best long-form journalism pieces since 2011. How to research such pieces.",
        "Week 4": "Give initial reading of how to approach research and writing, assignment: focused on some social or non-political policy issue, how to write a coherent article.",
        "Week Null": "Multimedia: Evolution of journalism\nTraditional Vs Digital Storytelling\nImpact of technology and News reporting \nPhotojournalism and infographics( data journalism)\nVisual storytelling, documentary and impact of audio\nHow to create a podcast"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sports and Skills Summer School",
        "School ID": "4",
        "Course ID": "45",
        "Course Name": "Advanced Music Production",
        "Club": "Symphony",
        "Desc_short": "Advanced Level Music Production to refine your skillset",
        "Desc": "This intensive course is designed for music producers who already possess foundational knowledge and seek to master advanced production techniques, sound design, mixing, and creative direction. Through hands-on projects, deep technical analysis, and exposure to professional workflows, students will refine their skills to a professional standard. The course bridges the gap between competent production and industry-ready music creation, tailored across genres such as electronic, hip-hop, metal and fusion.",
        "Week_time": "4 hours",
        "Evaluation": "Attendance of classes, Weekly assignments (Worksheet), And mixing/production deliverables",
        "Certification": "above 80% attendance, Assignment submissions",
        "Pre-req": "IMLP Production completed/ instructor approval",
        "Contact info": "Siddharth Kumar Khanda (7568267949)",
        "Week 1": "Session 1: Deep Dive into Session Management\n\nAdvanced DAW templates, routing, session prep for genres\n\nGain staging, reference tracks, CPU/latency optimization\n\n\nSession 2: Critical Listening & Ear Training\n\nFrequency identification drills, stereo imaging exercises",
        "Week 2": "Advanced EQ & Compression\n\nSession 1: Surgical vs Musical EQ Techniques\n\nDynamic EQ, mid-side EQ, tonal shaping across busses\n\n\nSession 2: Compression Mastery\n\nParallel, multiband, and serial compression\n\nShaping transients, glueing mixes, compressor types",
        "Week 3": "Sound Design & Creative Processing\n\nSession 1: Synthesis and Sampling\n\nAdvanced subtractive/FM/wavetable synthesis, resampling\n\nLayering synths, textures, cinematic sound design basics\n\n\nSession 2: FX Chains & Creative Processing\n\nReverb tricks, delay throws, vocal FX, modulation FX chains",
        "Week 4": "Mixing Advanced Elements\n\nSession 1: Mixing Vocals Deep Dive\n\nDe-essing, tuning, doubling, saturation, FX automation\n\n\nSession 2: Drum and Bass Integration\n\nKick/bass glue, transient shaping, rhythmic pocket",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sports and Skills Summer School",
        "School ID": "4",
        "Course ID": "46",
        "Course Name": "An Introduction to Writing and Performing Stand-Up Comedy",
        "Club": "ComedyCons ",
        "Desc_short": "This course will teach you can take any funny idea and extract the maximum out of it. It teaches you how stand-up comedians write their material, from the basic terms to complex principles. And it teaches you how to perform on stage with the genuine energy that makes it work every time.",
        "Desc": "This course provides you everything you need to start writing your jokes and perform stand-up comedy. It begins from the basics, and takes you to the advanced principles of joke-writing. It tells you how to come up with a joke and then modify it so that it reaches it's full potential to generate the maximum amount of laughter. The course ends with a part on performance, about how you can be genuine and confident on stage. After finishing this course, you only need to practice all that you will learn, and no one can stop you from becoming a stand-up comedian.",
        "Week_time": "3 hours ",
        "Evaluation": " 10 % completing the study material , 90% assignments and quizzes",
        "Certification": "Completion of quizzes and assignments",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Viraj Pondkule : +91 77559 02716",
        "Week 1": "Types of stand up comedy, premise, set up, punchline, attitude of a joke",
        "Week 2": "Writing a joke: Taking a funny idea and converting it into a joke. Principles of joke writing 1: Seesaw Theory, Balloon Pops, Boom mic moments.",
        "Week 3": "\nWriting a joke: Principles of joke writing 2: Victim of a joke, Triple Punches, Tension, Misdirection, Status, Persona",
        "Week 4": "Performing Stand-up: Building likability using self-deprecating humor, Genuine energy, Making the audience comfortable, being confident on stage",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sustainability Summer School",
        "School ID": "5",
        "Course ID": "51",
        "Course Name": "Sustainable Economics: Markets, Policies, and the Planet",
        "Club": "Economics Association",
        "Desc_short": "Can markets save the planet? \nSustainable Economics: Markets, Policies, and the Planet is a bold, engaging course that explores how economic thinking can fight climate change and shape a fairer, greener future. You'll uncover the hidden costs of pollution, learn how carbon pricing works, explore how green finance and ESG investing are reshaping global markets, and understand how cities and jobs can transition to a low-carbon economy without leaving people behind. No prior economics background needed, just curiosity, critical thinking, and the drive to make a difference.",
        "Desc": "Can markets really save the planet? Join Sustainable Economics: Markets, Policies, and the Planet — an exciting, action-packed course where climate meets capitalism, and students become changemakers. Explore how economic tools can tackle the climate crisis through four power-packed modules:\nModule 1: Climate by the Numbers – Understand market failures, public goods, and the true cost of carbon.\nModule 2: Pricing Carbon – Learn how taxes, cap-and-trade, and smart policies can drive change.\nModule 3: Green Finance – Discover ESG, green bonds, and how investing can build a sustainable future.\nModule 4: Just Green Transition – Dive into green jobs, urban sustainability, and equity in the energy shift.\nNo heavy economics background needed — just curiosity and the will to change the world. Ready to rethink the future?\n\n\n",
        "Week_time": "6-8 hours",
        "Evaluation": "weekly conceptual quizzing and a project on the basis of your understanding of the concept",
        "Certification": "Submit a final project (basic effort and relevance expected)",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Eshani Mailk (9952999987)",
        "Week 1": "Module 1: Economics Meets Climate – The Crisis in Numbers\nWhy the market fails when it comes to the environment\n\nWhat externalities and public goods have to do with rising sea levels\n\nHow to see climate change in numbers\n\nWatch: The Climate Casino + Eye-opening videos on global warming’s real economic cost",
        "Week 2": "Module 2: Pricing Carbon – Can Markets Save the Planet?\nWhat exactly is a carbon tax?\n\nIs cap-and-trade just jargon or a real solution?\n\nCan markets fix themselves?\n\nDive into resources from the IMF, CEPR, and the World Bank + gripping explainer videos",
        "Week 3": "Module 3: Green Finance & Investing in a Sustainable Future\nWhat is ESG and why are top companies racing to prove theirs?\n\nWhat makes a green bond green?\n\nCan finance be a force for good?\n\nExplore how Wall Street and Main Street are aligning with the Earth’s needs\n\n",
        "Week 4": "Module 4: Cities, Jobs & the Just Green Transition\nWhat does a just transition look like for workers and cities?\n\nWhat are green jobs, and how can YOU get one?\n\nHow do we make cities smart and sustainable?\n\nFrom climate equity to urban innovation, this module is all about real change and future careers",
        "Week Null": "Work on project"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sustainability Summer School",
        "School ID": "5",
        "Course ID": "52",
        "Course Name": "Zero Waste Vision - OpenCV: For when you want Vision but aren’t Wanda",
        "Club": "Team Zero Waste",
        "Desc_short": "Welcome to Zero Waste Vision: a chill, 4-week self-paced intro to computer vision. We’ll start from square one (literally, pixels) and show you how images are just numbers in disguise. From reading and tweaking images to playing with webcam feeds and deploying YOLOv8 for object detection, you’ll teach your code to see the world.\n",
        "Desc": "Wanda rewrote reality with her mind. You? You’ll do it with code. This summer, ditch the drama and embrace the pixels because we’re teaching you how to make machines see using OpenCV, Python, and YOLOv8. It’s 4 weeks of no-pressure, slightly magical computer vision, minus the emotional breakdowns (we hope).\n\nHere’s  what you’ll learn:\n\n1.What is actually an image?\n2.How computers look at images and say “huh, that’s a cat”\n3.OpenCV basics: filters, contours, webcam chaos\n4.YOLOv8 for object detection—because “You Only Look Once” \n5.A final project where you bend reality (or at least a video feed) to your will\n\nWe’ll give you curated resources, mini-assignments, and exactly zero lectures\n",
        "Week_time": "6-7 hours",
        "Evaluation": "We won't grade you with a red pen, but here's how we’ll know you’re killin’ it:\n\nMini Assignments (40%)\nShort, hands-on tasks each week like:\n  Grayscale and filter effects\n  Webcam capture + live filters\n  Detecting basic objects with YOLOv8\n\nFinal Project (50%)\nPick a fun problem and solve it using YOLOv8\nExample: detect plastic bottles in the trash, find snacks in your room, etc.\nSubmit code + short report (or demo video)\n\nMeme / Reflection (10%)\n\nOne-paragraph takeaway OR one solid meme about your journey.\nExtra points for GIFs. We have no shame.\n",
        "Certification": "To earn your certification Submit at least 3/4 mini assignments,  Complete final project,   Send a meme/reflection that proves you survived.",
        "Pre-req": "Know a bit of Python (loops, functions, lists), Can install libraries using pip (or are willing to try 37 times), are curious enough to Google stuff, Basically, bring enthusiasm. We’ll bring the rest.",
        "Contact info": "Astha Sahu (8144151551)",
        "Week 1": "Intro to Computer Vision & OpenCV\n\nWhat is computer vision? Use cases & real-world magic- Set up OpenCV in Python- Read, write, display, and modify images",
        "Week 2": "Videos, Filters & Webcam Magic\n\nAccess webcam & video streams- Draw shapes, overlay text on frames- Apply filters (blur, grayscale, edge detection)",
        "Week 3": "YOLOv8 Basics & Object Detection\n\nInstall YOLOv8 (Ultralytics)- Run object detection on images/videos- Understand bounding boxes, class labels, and confidence scores",
        "Week 4": "Custom Project Week\n\nPick an object/topic of interest- Use YOLOv8 on custom or real-time data- Submit final project + bonus meme or reflection\n",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sustainability Summer School",
        "School ID": "5",
        "Course ID": "53",
        "Course Name": "The Carbon Code: Trading, Tracking & Transforming Emissions",
        "Club": "Energy and Sustainability Club ",
        "Desc_short": "Carbon as Currency: Trading the Future of the Climate",
        "Desc": "Over four immersive weeks, you’ll gain a deep understanding of how carbon credits work, who uses them, how they’re traded, and what impact they really have. You'll calculate your own carbon footprint, examine how major companies offset emissions, and explore creative ways to drive meaningful climate action. Whether you're interested in clean-tech or shaping the future of carbon markets or just want an idea of how carbon problems are being tackled today, this course will give you the tools and vision to innovate at the heart of the sustainability movement.",
        "Week_time": "3-4 hours",
        "Evaluation": "3 activities - 10% each\n3 quizzes - 10% each\nend project - 40%",
        "Certification": "Minimum 60 % marks in the course and mandatory project submission",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Ojas Dangi (8448877871), Shrestha Jain (9491715670)",
        "Week 1": "Detailed insights about Carbon Footprints and Carbon Credits\n",
        "Week 2": "Credit Crafting: Behind the Scenes of Carbon Projects\n",
        "Week 3": "Trading and Pricing of Carbon Credits, Foundations of Carbon Markets \n",
        "Week 4": "Ethics and Future Trends, Career Opportunities",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sustainability Summer School",
        "School ID": "5",
        "Course ID": "54",
        "Course Name": "Solar Energy & The Global Shift",
        "Club": "Energy and Sustainability Club ",
        "Desc_short": "Watt's Next? Solar\nExplore the science of photovoltaics: World’s fastest-growing energy source",
        "Desc": "- Explore the role of solar energy in the global transition to clean and sustainable future.\n- Understand the science behind solar cells, including semiconductor physics and how sunlight is converted into electricity.\n- Learn light management techniques to enhance solar cell efficiency through smart optical design.\n- Real world solar applications, business models, and career pathways in the Indian and global context. Gain practical knowledge through case studies and solar tools.",
        "Week_time": "3-4 hours",
        "Evaluation": "15% weightage Week 1 quiz \n25% weightage Week 2 quiz\n25% weightage Week 3 quiz\n35% weightage of final presentation",
        "Certification": "Attempt all 3 quizzes and make the final presentation",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Samay Dora: (8847603399), Sushat Kumar Kashyap(6391275528)",
        "Week 1": "Understand the global energy transition, solar basics and India’s solar growth.",
        "Week 2": "Learn how solar cells work, the role of semiconductors, solar cell types, and how light is managed in PV technology.",
        "Week 3": "Learn about solar module design, system layout, performance factors, inverters, and grid vs off-grid systems.",
        "Week 4": "Explore real world solar use cases, business models, career paths and final presentation from the students.",
        "Week Null": "-"
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sustainability Summer School",
        "School ID": "5",
        "Course ID": "55",
        "Course Name": "Sustainability Research & Policy: Understanding Campus Waste and Policy Design",
        "Club": "Team Zero Waste",
        "Desc_short": "This course empowers students to explore and address campus waste management issues by conducting audits, designing evidence-based policies, and proposing infrastructure solutions. It integrates hands-on learning with research and policy formulation for real-world impact.",
        "Desc": "This four-week course introduces students to the systemic challenges and solutions surrounding waste management on campus. Through a blend of live sessions, practical audits, policy drafting, and infrastructure planning, learners engage deeply with different types of waste: wet, dry, e-waste, and biomedical. Each week builds upon the previous one, encouraging students to focus on a specific waste type and propose actionable policy and design solutions tailored to their campus. The course also emphasizes stakeholder engagement, real data analysis, and sustainability-centered thinking. \n\nFinal Deliverables\n1. Waste Audit Report: A detailed report on the data collected during their audit, including\ninsights and recommendations for improvement.\n2. Policy Proposal: A policy document that includes the waste type chosen, the identified\nproblem, and the proposed policy solution.\n3. Waste Management Infrastructure Design: A visual model of their proposed waste\nsegregation system, with an evaluation of its potential impact.\n4. Reflection: A personal reflection (1 page) on the course, what they learned, and how\nthey would apply this knowledge to improve sustainability on campus\n\n● Live Sessions: These are common for all students during Weeks 1 to 4. After Week 1,\nstudents will focus on their chosen waste type, with tailored tasks to deepen their\nunderstanding and policy design in that area.\n● Personal Choice: In Week 2 and beyond, students select which waste type they want to\nfocus on (wet, dry, e-waste, biomedical). This allows for a personalized learning\nexperience, while still maintaining a cohesive course structure.",
        "Week_time": "5 Hours",
        "Evaluation": "10% attendance \n20% Group Discussions\n50% Homework tasks\n30% Project\n",
        "Certification": "more than 75% attendance  Compulsory presence in GDs and submission of final project ",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Astha Sahu (8144151551)",
        "Week 1": "○ Introduction to different types of waste on campus (wet, dry, sanitary, e-waste,\nbiomedical).\n○ The importance of waste management and its environmental impact.\n○ Overview of IITB's waste management system and general waste flow\n(generation, collection, disposal, impact).",
        "Week 2": "○ Introduction to waste audits: What they are, why they matter, and how to conduct\none.\n○ Explaining key audit metrics like waste volume, contamination rate, and\nsegregation efficiency.\n○ Students choose the type of waste they’d like to focus on: Wet Waste, Dry\nWaste, E-Waste, or Biomedical Waste.\n",
        "Week 3": "○ Introduction to policy instruments and their role in waste management.\n○ Types of policy tools: Mandates, Nudges, Bans, Incentives, and Voluntary\nAgreements.\n○ Case study of successful policy implementations (e.g., plastic bans, incentivized\nrecycling programs).",
        "Week 4": "○ Introduction to designing waste management infrastructure (e.g., 3-bin systems,\ncomposting units, collection methods).\n○ Overview of how to engage vendors (recyclers, composters, etc.) and evaluate\nthem.\n○ How to analyze cost-benefit in implementing different infrastructure models\n(e.g., on-campus composting vs. outsourcing).\n",
        "Week Null": ""
    },
    {
        "Which of the following schools would you think this course is most aligned to (the name of the school may be changed (and in fact I would like suggestions)). The idea is to provide each course emphasis, by clearly conveying it's interest domain to audience and hopefully get more registrations.": "The Sustainability Summer School",
        "School ID": "5",
        "Course ID": "56",
        "Course Name": "Sustainable Policies 101",
        "Club": "Sustainability Cell",
        "Desc_short": "In a world facing a climate crisis, understanding how environmental change is governed is just as important as knowing why it matters. This course is your gateway to the policy side of sustainability — no prior background needed. Whether you want to work in policy, start a green initiative, or simply make sense of headlines around COP and carbon credits, Sustainable Policies 101 will give you the vocabulary and vision to start making an impact.",
        "Desc": "Sustainable Policies 101 is a beginner-friendly course that introduces you to the world of environmental governance — from global climate negotiations to how local municipalities manage waste. Across four weeks, you'll explore the institutions, policies, principles, and real-world case studies that shape environmental decision-making at every level. Whether you're curious about COPs, carbon markets, or how your city plans for sustainability, this course connects the dots between climate science and climate action — in a language you can relate to.",
        "Week_time": "6-7 hours",
        "Evaluation": "70% Project / Assignments\n30% Compulsory Attendance \n",
        "Certification": "Attend at least 2/3 live sessions. Complete the capstone project before the deadline",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Arth Trivedy (8368009080), Siddhant Gupta (9167095841), Vinayak Jalan (7043772478)",
        "Week 1": "What is Environmental Policy? Evolution, Purpose, and Scope\nKey Actors: Government, Market, Civil Society, Judiciary\nGlobal Environmental Governance Frameworks (UNEP, IPCC, UNFCCC)\nPrinciples of Environmental Governance (PPP, precautionary, intergenerational equity)\n",
        "Week 2": "Indian Constitutional Provisions & Key Environmental Laws\nInstitutions: MoEFCC, CPCB, NGT, State Agencies\nThe NAPCC, SAPCCs & India’s Climate Commitments\nEnvironmental Impact Assessment (EIA) – Process & Critique\n",
        "Week 3": "Global Agreements: Kyoto Protocol, Paris Agreement, Montreal Protocol\nThe COP Process: How Climate Negotiations Work\nClimate Finance: Loss & Damage, Green Climate Fund, Carbon Markets\nClimate Justice & Equity: Developed vs Developing Nations\n",
        "Week 4": "Urban Sustainability: Smart Cities, Green Buildings, Transit Policy\nLocal Governance: Municipal Policy, Solid Waste Management, Decentralization\nMarket Instruments: Carbon Pricing, EPR, Green Bonds\nPolicy Careers, Youth Action & The Future of Environmental Governance\n",
        "Week Null": "Project Week"
    }
]