[
    {
        "School Name": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "68",
        "Course Name": "Big Data Handling with Excel & SQL",
        "Club": "Analytics Club ",
        "Desc_short": "Dive into the world of data analysis using the most accessible tools out there. Whether you're a beginner or just looking to brush up your skills, this course takes you through Excel and SQL with bite-sized videos, practical assignments, designed to fit into your daily routine.",
        "Desc": "This course is designed to give students hands-on exposure to Excel and SQL, focusing on practical data analysis and real-world business use-cases. Through a curated set of short, beginner-friendly videos, you'll learn everything from spreadsheet fundamentals to pivot tables and conditional logic functions.\n\nWe emphasize clarity, simplicity, and accessibility. No prior experience is needed. Each video covers a specific feature, allowing you to steadily build your skills.\n\nThe course also includes assignments to reinforce your learning and help you develop fluency in tools that are widely used across industries today. You’ll also gain insight into how these tools compare with other modern alternatives and understand where they stand amidst today’s AI and automation wave.",
        "Week_time": "5 - 7  hours",
        "Evaluation": "Evaluative metric & Certification criteria [Excel] : \n5 assignments will be given, out of which any 3 are compulsory\nThe final project for Excel is compulsory\n\nEvaluative metric & Certification criteria [SQL]\n2 assignments will be given, any one of of them is compulsory\nFinal project is compulsory\n",
        "Certification": "3/5 assignments of Excel, 1/2 assignments of SQL and Final project",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Anviksha (7974346380), Anshuman (9880182957)",
        "Week 1": "Excel:\n- Introduction to spreadsheets\n- Basics of spreadsheets\n- Columns, row and cell formatting\n- Basics of formulas\n- Introduction to functions\n- Absolute and Relative referencing\n- Introduction to data quality & importing file data\n- Data cleaning techniques",
        "Week 2": "Excel:\n- Sorting & Filtering\n- Some important functions\n- VLOOKUP & HLOOKUP functions\n- Pivot Tables\nSQL:\n- Installation and setup\n- Introduction\n- Queries in SQL\n- Functions in SQL\n- Operators in SQL",
        "Week 3": "Excel:\n- All about Charts\n- Dashboarding\nSQL:\n- All about clauses\n- SQL Joins\n- Subquery in SQL",
        "Week 4": "\n1 project each for Excel and SQL",
        "Week Null": "",
        "null": [
            "",
            "",
            ""
        ]
    },
    {
        "School Name": "The CS and DS Summer School",
        "School ID": "6",
        "Course ID": "69",
        "Course Name": "Data Science Fundamentals with Python",
        "Club": "Analytics Club",
        "Desc_short": "Kickstart your data science journey with our beginner-friendly \"Data Science Fundamentals with Python\" course! Start from core Python skills, explore data handling and data visualization with exciting libraries transitioning to ML through supervised and unsupervised learning algorithms with in-depth yet carefully curated easy-to-follow resources finishing off with a perfect real world project to reinforce key concepts while building your portfolio. This isn’t just a course; it’s your gateway to mastering the transformation of Basic raw data into Brilliant actionable intelligence!",
        "Desc": "Step into one of the hottest career paths of the 21st century with this comprehensive four week course by the Analytics Club in Python for Data Science and Machine Learning as a part of Learner’s Space. Whether you're a curious student or a tech explorer leveling up your skill set, this course is your launchpad. We’ve packed it with in-depth yet carefully curated resources. From writing your first line of Python to building models that can actually think, you’ll learn to clean, analyze, and predict like a pro.\n\nThe course ends with a perfect bridge between theory and practical expertise. The Capstone Project is the culmination of your learning journey, where you apply supervised and unsupervised techniques to a real-world dataset-just like a professional data scientist. This hands-on experience reinforces key concepts, builds your portfolio, and boosts confidence in solving complex problems.\n\nNo prior experience is needed - just curiosity and commitment. Start from scratch, finish with real skills.",
        "Week_time": "7 - 8 hours",
        "Evaluation": "There will be 3 worksheets and 1 final capstone project",
        "Certification": "1st Phase worksheet, Atleast one among the 2nd and 3rd Phase worksheets and Capstone project are necessary for certification",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Tanya Menghani (6264592527), Pranav Mylarassu (9789952490)",
        "Week 1": "Python Modules\n\n\nPython Basics: Learn the building blocks of Python: variables, control flow, functions, and more.\nJupyter Notebooks: Explore the interactive coding environment used by data scientists.\nNumpy: Learn about dealing with arrays and vectorized computations in python.\nPandas: Dive into data manipulation with powerful tools for cleaning, filtering, and transforming datasets.\nMatplotlib: Create basic plots and visualizations to understand data trends and patterns.\nSeaborn: Build beautiful, statistical visualizations of data.\nWorksheet 1 – Apply your skills through hands-on coding exercises.\n",
        "Week 2": "Supervised Learning - Regression\n\nDomains of Analytics: Understand how data science, data analytics, and machine learning differ - and where they overlap.\nScikit-Learn Essentials: Get hands-on with the most popular ML library for Python.\nLinear Regression: Explore the fundamentals of modeling straight-line relationships in data.\nMultiple Linear Regression: Go beyond one feature and learn how to model with multiple predictors.\nTime Series Analysis: Understand time-dependent data and recognize temporal patterns.\nTime Series Forecasting: Explore statistical models such as ARMA to predict future trends.\nAnomaly detection: Discover how to spot unusual or unexpected behavior in time series data.\nWorksheet 2: Apply your learned skills through coding exercises and problems.",
        "Week 3": "Supervised Learning - Classification\nRegression vs Classification: Learn the key differences between predicting numbers and predicting categories.\nLogistic Regression: Model binary probabilities using this basic classification algorithm.\nDecision Trees & Random Forests: Learn about tree-based models that mimic human decision making.\nOptional Classification algorithms: Understand additional classification algorithms such as Support Vector Machines and K-Nearest Neighbors.\nNeural Networks – Delve into deep learning with one of the most powerful ML tools.\nProbability distributions and Central Limit Theorem: Learn about statistics and data behavior through Gaussian, Bernoulli, and Exponential distributions.\nWorksheet 3: Get hands-on experience with code implementation of ML algorithms.\n",
        "Week 4": " Unsupervised Learning\n\nIntro to Unsupervised Learning: Discover how machines find hidden patterns without labeled data or guidance.\nK-Means Clustering: Group similar data points into clusters based on distance.\nHierarchical Clustering: Build tree-like cluster structures to explore nested relationships in data.\nGaussian Mixture Models: Use probability-based clustering to model data that doesn’t fit into neat boundaries.\nDimensionality Reduction: Simplify complex datasets using techniques such as Principal Component Analysis, Singular Value Decomposition and Linear Discriminant Analysis.\nMatrix Factorization: Learn about the core technique behind recommendation systems.\nCapstone Project: Test your skills with a hands-on project encompassing the entire course content.\n",
        "Week Null": "",
        "null": [
            "",
            "",
            ""
        ]
    },
    {
        "School Name": "The Sustainability Summer School",
        "School ID": "5",
        "Course ID": "57",
        "Course Name": "Sustainable Buildings",
        "Club": "Team SHUNYA ",
        "Desc_short": "This lecture series by Team SHUNYA introduces students to the fundamentals of sustainable building design. Through interactive sessions, real-world case studies, and expert insights, participants will explore energy-efficient strategies, eco-friendly materials, and climate-responsive architecture. Whether you're an aspiring architect, engineer, or sustainability enthusiast, this series will equip you with the knowledge and inspiration to design for a greener future.\n",
        "Desc": "This lecture series offers a comprehensive introduction to the principles and practices of sustainable building design, tailored for students from diverse academic backgrounds. \n\nParticipants will gain insights into:\n\n-Sustainable architecture and climate-responsive design\n-Energy-efficient systems (passive and active strategies)\n-Green building materials and construction techniques\n-Net-zero energy and carbon-neutral buildings\n-Simulation tools and performance evaluation\n-Policy, certification, and global sustainability standards (e.g., GRIHA, LEED)\n\nThe series will also highlight key innovations and learnings from Team SHUNYA’s real-world project Vivaan, standing on the campus opposite hostel 6 including their Solar Decathlon-winning projects.\n\nBy the end of the course, students will be equipped with foundational knowledge to approach building design from an environmental, economic, and human-centric perspective—empowering them to contribute meaningfully to a sustainable built environment.\n\n",
        "Week_time": "2 hours ",
        "Evaluation": "Assignment and quiz ",
        "Certification": "Attendence and quiz ",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Mudrika (9257498799) ",
        "Week 1": "Foundations of Sustainable Design\n\nObjectives:\nLearn the basics of sustainable building design.\nUnderstand how buildings impact the environment.\nDiscover the importance of energy efficiency and passive design.\n\nActivities:\nIntroductory lecture\nCase studies of green buildings\nInteractive quiz or discussion",
        "Week 2": "Materials, Technologies & Real-World Examples\n\nObjectives:\nExplore eco-friendly materials and technologies.\nSee real-world examples of sustainable buildings.\nDiscover smart design strategies for energy savings.\n\nActivities:\nCase studies of green buildings\nGroup activity: Design a basic sustainable layout",
        "Week 3": "Life Cycle Assessment (LCA)\n\nObjectives:\n Understand the concept of Life Cycle Assessment in buildings.\n Learn to evaluate environmental impact from material to demolition.\n Explore tools and techniques used in LCA.\n\nActivities:\nLecture on LCA basics\nSoftware or manual LCA walkthrough\nGroup activity: Conduct a simplified LCA on a sample building component",
        "Week 4": "-",
        "Week Null": "",
        "null": [
            "",
            "",
            "--"
        ]
    },
    {
        "School Name": "The Management Summer School (Courses in Consult, Finance, Entrepreneurship, Economics*)",
        "School ID": "2",
        "Course ID": "25",
        "Course Name": "Fundamentals of Finance",
        "Club": "Finance Club",
        "Desc_short": "Unlock the secrets of smart money management and investment strategies. Build confidence in navigating personal finance, market dynamics and stock valuation. Gain practical tools to make informed financial decisions and take control of your financial future.",
        "Desc": "Fundamentals of Finance will introduce you to the essential concepts of financial literacy in a clear and practical manner. You will begin with personal money management topics such as budgeting, saving, and investing, before progressing to the effects of macroeconomic factors like GDP, inflation, and interest rates on markets.\nDelve into various asset classes like equities, debt, real estate, and commodities while learning how to create a diversified investment portfolio tailored to your financial goals and risk tolerance. You'll also enhance your ability to perform fundamental analysis, equipping you with the tools to read financial statements and spot investment prospects.\nThrough interactive speaker sessions and hands-on assignments, you will acquire real-world insights and practical strategies to confidently manage your finances and investments. Join us to take control of your financial future!",
        "Week_time": "3 hours of work per week, plus 1 additional hour for speaker sessions",
        "Evaluation": "There will be 4 assignments, one assignment per week, based on the content covered.\nEach assignment contributes equally to the overall assessment.",
        "Certification": "Successful completion of 3/4 assignments without any plagiarism or use of AI tools like ChatGPT, Gemini etc. and attendance in 3/4 speaker sessions",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Deepti (9310453152), Karthik (8977243111), Kunal (7020922818), Rajdeep (9958009329), Shashwat (9548765669), Shreya (9810465318)",
        "Week 1": "Personal Finance:\nLearn the essentials of managing money, including budgeting, saving, investing, and building an emergency fund. Understand stock market basics, the importance of diversification, and how to avoid common mistakes. Develop a mindset for long-term financial growth with simple, actionable steps.",
        "Week 2": "Macroeconomics and Market Functioning:\nUnderstand key economic indicators like GDP, inflation, interest rates, and unemployment, and how they impact markets and investments. Learn the basics of fiscal policy and government spending, and explore market cycles and economic trends affecting stocks, bonds, and personal finance.",
        "Week 3": "Asset Classes:\nGet an overview of key asset types—equity, debt, real estate, and commodities. Learn about their risk, liquidity, and role in income generation and portfolio diversification. Understand how investors allocate assets based on risk tolerance and financial goals.",
        "Week 4": "Fundamental Analysis:\nLearn to read financial statements and key ratios. Understand how to interpret earnings reports and connect financial data to stock valuation, helping you identify undervalued or overvalued stocks.",
        "Week Null": "",
        "null": [
            "",
            "",
            ""
        ]
    },
    {
        "School Name": "The Engineering Summer School",
        "School ID": "3",
        "Course ID": "38",
        "Course Name": "DIVING DEEP INTO CHEMICAL INDUSTRY: CONQUERING THE TECHNO-COMERCIAL ASPECTS",
        "Club": "CC and ChemETL Manager",
        "Desc_short": "This isn’t your typical classroom theory—learn how the chemical industry really works.\nFrom reactors and green tech to pricing strategies and investment decisions,\nwe blend engineering brilliance with business brains.\nExplore how shampoos, fuels, and pharmaceuticals are made—and sold.\nDecode global market trends, sustainability moves, and innovation strategies.\nWant to build, lead, or disrupt in chemicals?\nThis is your launchpad.\nThink beyond labs. Think impact.\nJoin us and conquer the techno-commercial world of chemicals!",
        "Desc": "Ever wondered what powers the $5-trillion global chemical industry behind your shampoo, your phone, and even the fuel in your car? This summer, we’re not just talking reactions—we’re decoding the real-world engine of the chemical world.\n\n“Diving Deep into Chemical Industry: Conquering the Techno-Commercial Aspects” is your gateway to understanding not just how chemicals are made, but how the industry makes money, impacts lives, and drives innovation. Across four immersive modules, this course bridges hard-core engineering with sharp business insight—arming you with the skills every chemical industry leader needs.\n\nYou'll explore:\n\nThe evolution, trends, and global scope of the chemical industry.\n\nThe engineering backbone—process design, kinetics, catalysis, separation, and modern technologies like green chemistry.\n\nThe markets—understand how chemicals fuel everything from pharmaceuticals to energy, and how demand shapes production.\n\nThe business—costs, pricing, investments, R&D, and real-world decisions chemical companies face daily.\n\nWhether you're curious about how your classroom concepts apply to billion-dollar industries, or you dream of running your own chemical venture someday, this course will fuel your ambition and give you clarity on where your passion can lead.",
        "Week_time": "3 hours",
        "Evaluation": "Total of four modules, each will have its own quiz of 10 marks approx and last final report of 60 marks.",
        "Certification": "to clear the course passing criteria is 60% of total",
        "Pre-req": "Just your enthusiasm!",
        "Contact info": "Jay Shah (9428055438) Aniket Agarwal (6205741275)",
        "Week 1": "Introduction to the Chemical Industry\nUncover the evolution and scope of the chemical industry—from ancient alchemy to global powerhouses.\nUnderstand where India stands and where the world is heading.\nGet introduced to techno-commercial thinking that drives real-world decision-making.",
        "Week 2": "Chemical Processes and Technologies\nGo inside the heart of production—mass balances, reactors, catalysis, and separations.\nExplore how processes are optimized for efficiency, sustainability, and scale.\nDiscover how modern tools like green chemistry and simulation shape the future.",
        "Week 3": "Chemical Products and Markets\nLearn what the world demands—specialty chemicals, pharma, petrochemicals, and more.\nSee how chemicals power industries like agriculture, construction, and electronics.\nUnderstand market trends, demand drivers, and the booming Indian chemical scene.",
        "Week 4": "Chemical Economics & Management\nGet into the business side—costing, pricing, profitability, and investments.\nTackle real-world challenges like supply chains, quality, and safety.\nSee how innovation and R&D fuel billion-dollar decisions in the chemical world.\n\n",
        "Week Null": "",
        "null": [
            "",
            "",
            ""
        ]
    },
    {
        "School Name": "The Science Summer School (Pure Sciences like Maths, Biology, Physics, Chemistry, Economics*)",
        "School ID": "1",
        "Course ID": "12",
        "Course Name": "Computational Soft and Active Matter: Modeling Self-Organisation and Collective Behavior",
        "Club": "Students' Association of Physics Department",
        "Desc_short": "From particles to patterns—simulate how flocks form, clusters jam, and agents organise in motion! Build your own soft and active matter simulations from scratch",
        "Desc": "This course offers an  introduction to computational modeling of soft and active matter systems, where students explore how complex collective behaviors emerge from simple rules. Over four weeks, learners will build interactive simulations using Python to investigate phenomena like clustering, jamming, and flocking.\n\nWeek 1 introduces particle dynamics and repulsive forces in soft matter systems.\n\nWeek 2 explores inter-particle potentials and self-organization, modeling systems like foams and colloids.\n\nWeek 3 dives into active matter, implementing the Vicsek model to simulate flocking and noise-driven phase transitions.\n\nWeek 4 brings it all together in a capstone-style project, modeling flocking agents navigating through obstacles using alignment, repulsion, and self-propulsion.\n\nStudents will use Python and libraries like numpy and matplotlib to visualize behaviours in real time. \n\nBy the end of the course, learners will have built their own simulation engines, developed insights into self-organization, and created a final project showcasing their understanding of soft and active matter systems.",
        "Week_time": "6-7 hours",
        "Evaluation": "Attendance: 75% required\nWeekly Assignments (60%)\nCapstone Project (40%)\nPassing Criteria: Minimum 50% overall to pass",
        "Certification": "75% attendance, out of 3 assignments one can be left, capstone project is must and 50% grades in assignments depending on code quality ",
        "Pre-req": "Some experience with Python (especially numpy and matplotlib)",
        "Contact info": "Ananya Priyaroop (9835045678), Pushiti Ashar (9870017287)",
        "Week 1": "\nIntegration methods: Euler, Velocity Verlet\nSoft repulsion using Lennard-Jones-like potential\nBoundary handling: reflective and periodic\nEnergy conservation basics\n\n",
        "Week 2": "\nClustering, aggregation, jamming phenomena\nAttractive-repulsive potentials (modified Lennard-Jones)\nSpatial metrics: pairwise distances, cluster sizes\nConcepts of equilibrium vs non-equilibrium systems\n\n",
        "Week 3": "Vicsek model: self-propulsion + local alignment + noise\nOrdered vs disordered states\nOrder parameter \nInfluence of noise and density\n\n",
        "Week 4": "Coupling Vicsek model with soft repulsion\nAdding static obstacles as repelling objects\nMeasuring density, energy, order",
        "Week Null": "",
        "null": [
            "",
            "",
            ""
        ]
    }
]